JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- downloaded from chipselect.org on 15.June 2025 -->
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Raspberry Pi</vendor>
  <name>RP2040</name>
  <version>2025.06.15</version>
  <description>RP2040</description>
  <cpu>
    <!--ARM Cortex-M0+-->
    <name>CM0PLUS</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Control and data interface to SAR ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>ADC_IRQ_FIFO</name>
        <value>22</value>
      </interrupt>
      <registers>
      <register>
        <name>CS</name>
        <description>ADC Control and Status</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AINSEL</name>
            <description>Select analog mux input. Updated automatically in round-robin mode.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EN</name>
            <description>Power on ADC and enable its clock.

 1 - enabled. 0 - disabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERR</name>
            <description>The most recent ADC conversion encountered an error result is undefined or noisy.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERR_STICKY</name>
            <description>Some past ADC conversion encountered an error. Write 1 to clear.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>READY</name>
            <description>1 if the ADC is ready to start a new conversion. Implies any previous conversion has completed.

 0 whilst conversion in progress.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RROBIN</name>
            <description>Round-robin sampling. 1 bit per channel. Set all bits to 0 to disable.

 Otherwise, the ADC will cycle through each enabled channel in a round-robin fashion.

 The first channel to be sampled will be the one currently indicated by AINSEL.

 AINSEL will be updated after each conversion with the newly-selected channel.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>START_MANY</name>
            <description>Continuously perform conversions whilst this bit is 1. A new conversion will start immediately after the previous finishes.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>START_ONCE</name>
            <description>Start a single conversion. Self-clearing. Ignored if start_many is asserted.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>TS_EN</name>
            <description>Power on temperature sensor. 1 - enabled. 0 - disabled.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DIV</name>
        <description>Clock divider. If non-zero, CS_START_MANY will start conversions

 at regular intervals rather than back-to-back.

 The divider is reset when either of these fields are written.

 Total period is 1 + INT + FRAC / 256</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional part of clock divisor. First-order delta-sigma.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Integer part of clock divisor.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FCS</name>
        <description>FIFO control and status</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DREQ_EN</name>
            <description>If 1: assert DMA requests when FIFO contains data</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EMPTY</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EN</name>
            <description>If 1: write result to the FIFO after each conversion.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERR</name>
            <description>If 1: conversion error bit appears in the FIFO alongside the result</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FULL</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>LEVEL</name>
            <description>The number of conversion results currently waiting in the FIFO</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OVER</name>
            <description>1 if the FIFO has been overflowed. Write 1 to clear.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>SHIFT</name>
            <description>If 1: FIFO results are right-shifted to be one byte in size. Enables DMA to byte buffers.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>THRESH</name>
            <description>DREQ/IRQ asserted when level &gt;= threshold</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>UNDER</name>
            <description>1 if the FIFO has been underflowed. Write 1 to clear.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>FIFO</name>
        <description>Conversion result FIFO</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ERR</name>
            <description>1 if this particular sample experienced a conversion error. Remains in the same location if the sample is shifted.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VAL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTE</name>
        <description>Interrupt Enable</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO</name>
            <description>Triggered when the sample FIFO reaches a certain level.

 This level can be programmed via the FCS_THRESH field.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <description>Interrupt Force</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO</name>
            <description>Triggered when the sample FIFO reaches a certain level.

 This level can be programmed via the FCS_THRESH field.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO</name>
            <description>Triggered when the sample FIFO reaches a certain level.

 This level can be programmed via the FCS_THRESH field.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTS</name>
        <description>Interrupt status after masking &amp; forcing</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO</name>
            <description>Triggered when the sample FIFO reaches a certain level.

 This level can be programmed via the FCS_THRESH field.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RESULT</name>
        <description>Result of most recent ADC conversion</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RESULT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
