JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BUSCTRL</name>
      <description>Register block for busfabric control signals and performance counters</description>
      <groupName>BUSCTRL</groupName>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>BUS_PRIORITY</name>
        <description>Set the priority of each master for bus arbitration.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DMA_R</name>
            <description>0 - low priority, 1 - high priority</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DMA_W</name>
            <description>0 - low priority, 1 - high priority</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC0</name>
            <description>0 - low priority, 1 - high priority</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC1</name>
            <description>0 - low priority, 1 - high priority</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>BUS_PRIORITY_ACK</name>
        <description>Bus priority acknowledge</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BUS_PRIORITY_ACK</name>
            <description>Goes to 1 once all arbiters have registered the new global priority levels.

 Arbiters update their local priority when servicing a new nonsequential access.

 In normal circumstances this will happen almost immediately.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFCTR0</name>
        <description>Bus fabric performance counter 0</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFCTR0</name>
            <description>Busfabric saturating performance counter 0

 Count some event signal from the busfabric arbiters.

 Write any value to clear. Select an event to count using PERFSEL0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFCTR1</name>
        <description>Bus fabric performance counter 1</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFCTR1</name>
            <description>Busfabric saturating performance counter 1

 Count some event signal from the busfabric arbiters.

 Write any value to clear. Select an event to count using PERFSEL1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFCTR2</name>
        <description>Bus fabric performance counter 2</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFCTR2</name>
            <description>Busfabric saturating performance counter 2

 Count some event signal from the busfabric arbiters.

 Write any value to clear. Select an event to count using PERFSEL2</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFCTR3</name>
        <description>Bus fabric performance counter 3</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFCTR3</name>
            <description>Busfabric saturating performance counter 3

 Count some event signal from the busfabric arbiters.

 Write any value to clear. Select an event to count using PERFSEL3</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFSEL0</name>
        <description>Bus fabric performance event select for PERFCTR0</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFSEL0</name>
            <description>Select an event for PERFCTR0. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>apb_contested</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>apb</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2_contested</name>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2</name>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1_contested</name>
                <value>12</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1</name>
                <value>13</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0_contested</name>
                <value>14</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0</name>
                <value>15</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main_contested</name>
                <value>16</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main</name>
                <value>17</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom_contested</name>
                <value>18</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom</name>
                <value>19</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi_contested</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi</name>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5_contested</name>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5</name>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4_contested</name>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4</name>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3_contested</name>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3</name>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFSEL1</name>
        <description>Bus fabric performance event select for PERFCTR1</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFSEL1</name>
            <description>Select an event for PERFCTR1. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>apb_contested</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>apb</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2_contested</name>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2</name>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1_contested</name>
                <value>12</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1</name>
                <value>13</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0_contested</name>
                <value>14</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0</name>
                <value>15</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main_contested</name>
                <value>16</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main</name>
                <value>17</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom_contested</name>
                <value>18</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom</name>
                <value>19</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi_contested</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi</name>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5_contested</name>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5</name>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4_contested</name>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4</name>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3_contested</name>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3</name>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFSEL2</name>
        <description>Bus fabric performance event select for PERFCTR2</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFSEL2</name>
            <description>Select an event for PERFCTR2. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>apb_contested</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>apb</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2_contested</name>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2</name>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1_contested</name>
                <value>12</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1</name>
                <value>13</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0_contested</name>
                <value>14</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0</name>
                <value>15</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main_contested</name>
                <value>16</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main</name>
                <value>17</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom_contested</name>
                <value>18</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom</name>
                <value>19</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi_contested</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi</name>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5_contested</name>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5</name>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4_contested</name>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4</name>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3_contested</name>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3</name>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PERFSEL3</name>
        <description>Bus fabric performance event select for PERFCTR3</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PERFSEL3</name>
            <description>Select an event for PERFCTR3. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>apb_contested</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>apb</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2_contested</name>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram2</name>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1_contested</name>
                <value>12</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram1</name>
                <value>13</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0_contested</name>
                <value>14</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram0</name>
                <value>15</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main_contested</name>
                <value>16</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xip_main</name>
                <value>17</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom_contested</name>
                <value>18</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rom</name>
                <value>19</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi_contested</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fastperi</name>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5_contested</name>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram5</name>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4_contested</name>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram4</name>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3_contested</name>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sram3</name>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
