JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 This must be set before the clock is enabled to have any effect</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_GPOUT0_DIV</name>
        <description>Clock divisor, can be changed on-the-fly</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional component of the divisor</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_GPOUT0_SELECTED</name>
        <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).

 This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CLK_GPOUT1_CTRL</name>
        <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AUXSRC</name>
            <description>Selects the auxiliary clock source, will glitch when switching</description>
            <bitOffset>5</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>clksrc_pll_sys</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin0</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_ref</name>
                <description>None</description>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin1</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_pll_usb</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xosc_clksrc</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_sys</name>
                <description>None</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_usb</name>
                <description>None</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_adc</name>
                <description>None</description>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_rtc</name>
                <description>None</description>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>DC50</name>
            <description>Enables duty cycle correction for odd divisors</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Starts and stops the clock generator cleanly</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>KILL</name>
            <description>Asynchronously kills the clock generator</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NUDGE</name>
            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock

 This can be done at any time</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PHASE</name>
            <description>This delays the enable signal by up to 3 cycles of the input clock

 This must be set before the clock is enabled to have any effect</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_GPOUT1_DIV</name>
        <description>Clock divisor, can be changed on-the-fly</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional component of the divisor</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_GPOUT1_SELECTED</name>
        <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).

 This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CLK_GPOUT2_CTRL</name>
        <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AUXSRC</name>
            <description>Selects the auxiliary clock source, will glitch when switching</description>
            <bitOffset>5</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>clksrc_pll_sys</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin0</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_ref</name>
                <description>None</description>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin1</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_pll_usb</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc_ph</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xosc_clksrc</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_sys</name>
                <description>None</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_usb</name>
                <description>None</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_adc</name>
                <description>None</description>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_rtc</name>
                <description>None</description>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>DC50</name>
            <description>Enables duty cycle correction for odd divisors</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Starts and stops the clock generator cleanly</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>KILL</name>
            <description>Asynchronously kills the clock generator</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NUDGE</name>
            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock

 This can be done at any time</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PHASE</name>
            <description>This delays the enable signal by up to 3 cycles of the input clock

