JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 This must be set before the clock is enabled to have any effect</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_RTC_DIV</name>
        <description>Clock divisor, can be changed on-the-fly</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional component of the divisor</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_RTC_SELECTED</name>
        <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).

 This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CLK_SYS_CTRL</name>
        <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AUXSRC</name>
            <description>Selects the auxiliary clock source, will glitch when switching</description>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>clksrc_pll_sys</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_pll_usb</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xosc_clksrc</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin0</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin1</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>SRC</name>
            <description>Selects the clock source glitchlessly, can be changed on-the-fly</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>clk_ref</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_clk_sys_aux</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_SYS_DIV</name>
        <description>Clock divisor, can be changed on-the-fly</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional component of the divisor</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_SYS_RESUS_CTRL</name>
        <addressOffset>0x78</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFF</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLEAR</name>
            <description>For clearing the resus after the fault that triggered it has been corrected</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enable resus</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FRCE</name>
            <description>Force a resus, for test purposes only</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIMEOUT</name>
            <description>This is expressed as a number of clk_ref cycles

 and must be &gt;= 2x clk_ref_freq/min_clk_tst_freq</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_SYS_RESUS_STATUS</name>
        <addressOffset>0x7C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RESUSSED</name>
            <description>Clock has been resuscitated, correct the error then send ctrl_clear=1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_SYS_SELECTED</name>
        <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).

 The glitchless multiplexer does not switch instantaneously (to avoid glitches), so software should poll this register to wait for the switch to complete. This register contains one decoded bit for each of the clock sources enumerated in the CTRL SRC field. At most one of these bits will be set at any time, indicating that clock is currently present at the output of the glitchless mux. Whilst switching is in progress, this register may briefly show all-0s.</description>
        <addressOffset>0x44</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CLK_USB_CTRL</name>
        <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AUXSRC</name>
            <description>Selects the auxiliary clock source, will glitch when switching</description>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>clksrc_pll_usb</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_pll_sys</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc_ph</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xosc_clksrc</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin0</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin1</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Starts and stops the clock generator cleanly</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>KILL</name>
            <description>Asynchronously kills the clock generator</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>NUDGE</name>
            <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock

 This can be done at any time</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PHASE</name>
            <description>This delays the enable signal by up to 3 cycles of the input clock

