JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 This must be set before the clock is enabled to have any effect</description>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_USB_DIV</name>
        <description>Clock divisor, can be changed on-the-fly</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INT</name>
            <description>Integer component of the divisor, 0 -&gt; divide by 2^16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CLK_USB_SELECTED</name>
        <description>Indicates which SRC is currently selected by the glitchless mux (one-hot).

 This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
        <addressOffset>0x5C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>ENABLED0</name>
        <description>indicates the state of the clock enable</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>clk_adc_adc</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_peri_spi0</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_peri_spi1</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_rtc_rtc</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_adc</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_busctrl</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_busfabric</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_clocks</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_dma</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_i2c0</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_i2c1</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_io</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_jtag</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pads</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pio0</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pio1</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pll_sys</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pll_usb</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_psm</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_pwm</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_resets</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_rom</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_rosc</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_rtc</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sio</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_spi0</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_spi1</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram0</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram1</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram2</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram3</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_vreg_and_chip_reset</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ENABLED1</name>
        <description>indicates the state of the clock enable</description>
        <addressOffset>0xB4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>clk_peri_uart0</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_peri_uart1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sram5</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_syscfg</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_sysinfo</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_tbman</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_timer</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_uart0</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_uart1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_usbctrl</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_watchdog</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_xip</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_sys_xosc</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>clk_usb_usbctrl</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_DELAY</name>
        <description>Delays the start of frequency counting to allow the mux to settle

 Delay is measured in multiples of the reference clock period</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_DELAY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_INTERVAL</name>
        <description>The test interval is 0.98us * 2**interval, but let&apos;s call it 1us * 2**interval

 The default gives a test interval of 250us</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x8</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_INTERVAL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_MAX_KHZ</name>
        <description>Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff if you are not using the pass/fail flags</description>
        <addressOffset>0x88</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1FFFFFF</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_MAX_KHZ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>25</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_MIN_KHZ</name>
        <description>Minimum pass frequency in kHz. This is optional. Set to 0 if you are not using the pass/fail flags</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_MIN_KHZ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>25</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_REF_KHZ</name>
        <description>Reference clock frequency in kHz</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_REF_KHZ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_RESULT</name>
        <description>Result of frequency measurement, only valid when status_done=1</description>
        <addressOffset>0x9C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>KHZ</name>
            <bitOffset>5</bitOffset>
            <bitWidth>25</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_SRC</name>
        <description>Clock sent to frequency counter, set to 0 when not required

 Writing to this register initiates the frequency count</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FC0_SRC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NULL</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pll_sys_clksrc_primary</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_peri</name>
                <description>None</description>
                <value>10</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_usb</name>
                <description>None</description>
                <value>11</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_adc</name>
                <description>None</description>
                <value>12</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_rtc</name>
                <description>None</description>
                <value>13</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pll_usb_clksrc_primary</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rosc_clksrc_ph</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>xosc_clksrc</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin0</name>
                <description>None</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clksrc_gpin1</name>
                <description>None</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_ref</name>
                <description>None</description>
                <value>8</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>clk_sys</name>
                <description>None</description>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>FC0_STATUS</name>
        <description>Frequency counter status</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DIED</name>
            <description>Test clock stopped during test</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DONE</name>
            <description>Test complete</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FAIL</name>
            <description>Test failed</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FAST</name>
            <description>Test clock faster than expected, only valid when status_done=1</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PASS</name>
            <description>Test passed</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RUNNING</name>
            <description>Test running</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SLOW</name>
            <description>Test clock slower than expected, only valid when status_done=1</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WAITING</name>
            <description>Waiting for test clock to start</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTE</name>
        <description>Interrupt Enable</description>
        <addressOffset>0xBC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLK_SYS_RESUS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <description>Interrupt Force</description>
        <addressOffset>0xC0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLK_SYS_RESUS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0xB8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLK_SYS_RESUS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTS</name>
        <description>Interrupt status after masking &amp; forcing</description>
        <addressOffset>0xC4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLK_SYS_RESUS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
