JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA with separate read and write masters</description>
      <groupName>DMA</groupName>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>DMA_IRQ_0</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA_IRQ_1</name>
        <value>12</value>
      </interrupt>
      <registers>
      <register>
        <name>CH0_AL1_CTRL</name>
        <description>Alias for channel 0 CTRL register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL1_READ_ADDR</name>
        <description>Alias for channel 0 READ_ADDR register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL1_TRANS_COUNT_TRIG</name>
        <description>Alias for channel 0 TRANS_COUNT register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL1_WRITE_ADDR</name>
        <description>Alias for channel 0 WRITE_ADDR register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL2_CTRL</name>
        <description>Alias for channel 0 CTRL register</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL2_READ_ADDR</name>
        <description>Alias for channel 0 READ_ADDR register</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL2_TRANS_COUNT</name>
        <description>Alias for channel 0 TRANS_COUNT register</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL2_WRITE_ADDR_TRIG</name>
        <description>Alias for channel 0 WRITE_ADDR register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL3_CTRL</name>
        <description>Alias for channel 0 CTRL register</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL3_READ_ADDR_TRIG</name>
        <description>Alias for channel 0 READ_ADDR register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL3_TRANS_COUNT</name>
        <description>Alias for channel 0 TRANS_COUNT register</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_AL3_WRITE_ADDR</name>
        <description>Alias for channel 0 WRITE_ADDR register</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH0_CTRL_TRIG</name>
        <description>DMA Channel 0 Control and Status</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AHB_ERROR</name>
            <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BSWAP</name>
            <description>Apply byte-swap transformation to DMA data.

 For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUSY</name>
            <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.


 To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CHAIN_TO</name>
            <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DATA_SIZE</name>
            <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>SIZE_BYTE</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SIZE_HALFWORD</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SIZE_WORD</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>EN</name>
            <description>DMA Channel Enable.

