JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HIGH_PRIORITY</name>
            <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.


 This only affects the order in which the DMA schedules channels. The DMA&apos;s bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INCR_READ</name>
            <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.


 Generally this should be disabled for peripheral-to-memory transfers.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INCR_WRITE</name>
            <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.


 Generally this should be disabled for memory-to-peripheral transfers.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IRQ_QUIET</name>
            <description>In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.


 This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks.</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>READ_ERROR</name>
            <description>If 1, the channel received a read bus error. Write one to clear.

 READ_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 3 transfers later)</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>RING_SEL</name>
            <description>Select whether RING_SIZE applies to read or write addresses.

 If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RING_SIZE</name>
            <description>Size of address wrap region. If 0, don&apos;t wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.


 Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>RING_NONE</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>SNIFF_EN</name>
            <description>If 1, this channel&apos;s data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.


 This allows checksum to be enabled or disabled on a per-control- block basis.</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TREQ_SEL</name>
            <description>Select a Transfer Request signal.

 The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system).

 0x0 to 0x3a -&gt; select DREQ n as TREQ</description>
            <bitOffset>15</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>TIMER0</name>
                <description>Select Timer 0 as TREQ</description>
                <value>59</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>TIMER1</name>
                <description>Select Timer 1 as TREQ</description>
                <value>60</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>TIMER2</name>
                <description>Select Timer 2 as TREQ (Optional)</description>
                <value>61</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>TIMER3</name>
                <description>Select Timer 3 as TREQ (Optional)</description>
                <value>62</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>PERMANENT</name>
                <description>Permanent request, for unpaced transfers.</description>
                <value>63</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>WRITE_ERROR</name>
            <description>If 1, the channel received a write bus error. Write one to clear.

 WRITE_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 5 transfers later)</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4_DBG_CTDREQ</name>
        <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
        <addressOffset>0x900</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CH4_DBG_CTDREQ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4_DBG_TCR</name>
        <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
        <addressOffset>0x904</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH4_READ_ADDR</name>
        <description>DMA Channel 4 Read Address pointer

 This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
        <addressOffset>0x100</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH4_TRANS_COUNT</name>
        <description>DMA Channel 4 Transfer Count

