JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Program the number of bus transfers a channel will perform before halting. Note that, if transfers are larger than one byte in size, this is not equal to the number of bytes transferred (see CTRL_DATA_SIZE).


 When the channel is active, reading this register shows the number of transfers remaining, updating automatically each time a write transfer completes.


 Writing this register sets the RELOAD value for the transfer counter. Each time this channel is triggered, the RELOAD value is copied into the live transfer counter. The channel can be started multiple times, and will perform the same number of transfers each time, as programmed by most recent write.


 The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT is used as a trigger, the written value is used immediately as the length of the new transfer sequence, as well as being written to RELOAD.</description>
        <addressOffset>0x108</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH4_WRITE_ADDR</name>
        <description>DMA Channel 4 Write Address pointer

 This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
        <addressOffset>0x104</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL1_CTRL</name>
        <description>Alias for channel 5 CTRL register</description>
        <addressOffset>0x150</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL1_READ_ADDR</name>
        <description>Alias for channel 5 READ_ADDR register</description>
        <addressOffset>0x154</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL1_TRANS_COUNT_TRIG</name>
        <description>Alias for channel 5 TRANS_COUNT register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x15C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL1_WRITE_ADDR</name>
        <description>Alias for channel 5 WRITE_ADDR register</description>
        <addressOffset>0x158</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL2_CTRL</name>
        <description>Alias for channel 5 CTRL register</description>
        <addressOffset>0x160</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL2_READ_ADDR</name>
        <description>Alias for channel 5 READ_ADDR register</description>
        <addressOffset>0x168</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL2_TRANS_COUNT</name>
        <description>Alias for channel 5 TRANS_COUNT register</description>
        <addressOffset>0x164</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL2_WRITE_ADDR_TRIG</name>
        <description>Alias for channel 5 WRITE_ADDR register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x16C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL3_CTRL</name>
        <description>Alias for channel 5 CTRL register</description>
        <addressOffset>0x170</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL3_READ_ADDR_TRIG</name>
        <description>Alias for channel 5 READ_ADDR register

 This is a trigger register (0xc). Writing a nonzero value will

 reload the channel counter and start the channel.</description>
        <addressOffset>0x17C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL3_TRANS_COUNT</name>
        <description>Alias for channel 5 TRANS_COUNT register</description>
        <addressOffset>0x178</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_AL3_WRITE_ADDR</name>
        <description>Alias for channel 5 WRITE_ADDR register</description>
        <addressOffset>0x174</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>CH5_CTRL_TRIG</name>
        <description>DMA Channel 5 Control and Status</description>
        <addressOffset>0x14C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AHB_ERROR</name>
            <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BSWAP</name>
            <description>Apply byte-swap transformation to DMA data.

 For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUSY</name>
            <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.


 To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CHAIN_TO</name>
            <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DATA_SIZE</name>
            <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>SIZE_BYTE</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SIZE_HALFWORD</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SIZE_WORD</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>EN</name>
            <description>DMA Channel Enable.

