JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 It is also valid to ignore this behaviour and just use INTE0/INTS0/IRQ 0.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTS0</name>
        <description>Interrupt Status for IRQ 0</description>
        <addressOffset>0x40C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTS0</name>
            <description>Indicates active channel interrupt requests which are currently causing IRQ 0 to be asserted.

 Channel interrupts can be cleared by writing a bit mask here.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>INTS1</name>
        <description>Interrupt Status (masked) for IRQ 1</description>
        <addressOffset>0x41C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTS1</name>
            <description>Indicates active channel interrupt requests which are currently causing IRQ 1 to be asserted.

 Channel interrupts can be cleared by writing a bit mask here.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>MULTI_CHAN_TRIGGER</name>
        <description>Trigger one or more channels simultaneously</description>
        <addressOffset>0x430</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MULTI_CHAN_TRIGGER</name>
            <description>Each bit in this register corresponds to a DMA channel. Writing a 1 to the relevant bit is the same as writing to that channel&apos;s trigger register the channel will start if it is currently enabled and not already busy.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>N_CHANNELS</name>
        <description>The number of channels this DMA instance is equipped with. This DMA supports up to 16 hardware channels, but can be configured with as few as one, to minimise silicon area.</description>
        <addressOffset>0x448</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>N_CHANNELS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SNIFF_CTRL</name>
        <description>Sniffer Control</description>
        <addressOffset>0x434</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BSWAP</name>
            <description>Locally perform a byte reverse on the sniffed data, before feeding into checksum.


 Note that the sniff hardware is downstream of the DMA channel byteswap performed in the read master: if channel CTRL_BSWAP and SNIFF_CTRL_BSWAP are both enabled, their effects cancel from the sniffer&apos;s point of view.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CALC</name>
            <bitOffset>5</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>CRC32</name>
                <description>Calculate a CRC-32 (IEEE802.3 polynomial)</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>CRC32R</name>
                <description>Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>EVEN</name>
                <description>XOR reduction over all data. == 1 if the total 1 population count is odd.</description>
                <value>14</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SUM</name>
                <description>Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)</description>
                <value>15</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>CRC16</name>
                <description>Calculate a CRC-16-CCITT</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>CRC16R</name>
                <description>Calculate a CRC-16-CCITT with bit reversed data</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>DMACH</name>
            <description>DMA channel for Sniffer to observe</description>
            <bitOffset>1</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EN</name>
            <description>Enable sniffer</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_INV</name>
            <description>If set, the result appears inverted (bitwise complement) when read. This does not affect the way the checksum is calculated the result is transformed on-the-fly between the result register and the bus.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_REV</name>
            <description>If set, the result appears bit-reversed when read. This does not affect the way the checksum is calculated the result is transformed on-the-fly between the result register and the bus.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SNIFF_DATA</name>
        <description>Data accumulator for sniff hardware

 Write an initial seed value here before starting a DMA transfer on the channel indicated by SNIFF_CTRL_DMACH. The hardware will update this register each time it observes a read from the indicated channel. Once the channel completes, the final result can be read from this register.</description>
        <addressOffset>0x438</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>TIMER0</name>
        <description>Pacing (X/Y) Fractional Timer

 The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
        <addressOffset>0x420</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>X</name>
            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>Y</name>
            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER1</name>
        <description>Pacing (X/Y) Fractional Timer

 The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
        <addressOffset>0x424</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>X</name>
            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>Y</name>
            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER2</name>
        <description>Pacing (X/Y) Fractional Timer

 The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
        <addressOffset>0x428</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>X</name>
            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>Y</name>
            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TIMER3</name>
        <description>Pacing (X/Y) Fractional Timer

 The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less.</description>
        <addressOffset>0x42C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>X</name>
            <description>Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>Y</name>
            <description>Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
