JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_CLR_TX_ABRT</name>
        <description>Clear TX_ABRT Interrupt Register</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLR_TX_ABRT</name>
            <description>Read this register to clear the TX_ABRT interrupt (bit 6) of the IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE register. This also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO. Refer to Bit 9 of the IC_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE.


 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_CLR_TX_OVER</name>
        <description>Clear TX_OVER Interrupt Register</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLR_TX_OVER</name>
            <description>Read this register to clear the TX_OVER interrupt (bit 3) of the IC_RAW_INTR_STAT register.


 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_COMP_PARAM_1</name>
        <description>Component Parameter Register 1


 Note This register is not implemented and therefore reads as 0. If it was implemented it would be a constant read-only register that contains encoded information about the component&apos;s parameter settings. Fields shown below are the settings for those parameters</description>
        <addressOffset>0xF4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADD_ENCODED_PARAMS</name>
            <description>Encoded parameters not visible</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>APB_DATA_WIDTH</name>
            <description>APB data bus width is 32 bits</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HAS_DMA</name>
            <description>DMA handshaking signals are enabled</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HC_COUNT_VALUES</name>
            <description>Programmable count values for each mode.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INTR_IO</name>
            <description>COMBINED Interrupt outputs</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MAX_SPEED_MODE</name>
            <description>MAX SPEED MODE = FAST MODE</description>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RX_BUFFER_DEPTH</name>
            <description>RX Buffer Depth = 16</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX_BUFFER_DEPTH</name>
            <description>TX Buffer Depth = 16</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_COMP_TYPE</name>
        <description>I2C Component Type Register</description>
        <addressOffset>0xFC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x44570140</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IC_COMP_TYPE</name>
            <description>Designware Component Type number = 0x44_57_01_40. This assigned unique hex value is constant and is derived from the two ASCII letters &apos;DW&apos; followed by a 16-bit unsigned number.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_COMP_VERSION</name>
        <description>I2C Component Version Register</description>
        <addressOffset>0xF8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x3230312A</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IC_COMP_VERSION</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_CON</name>
        <description>I2C Control Register. This register can be written only when the DW_apb_i2c is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.


 Read/Write Access: - bit 10 is read only. - bit 11 is read only - bit 16 is read only - bit 17 is read only - bits 18 and 19 are read only.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x65</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IC_10BITADDR_MASTER</name>
            <description>Controls whether the DW_apb_i2c starts its transfers in 7- or 10-bit addressing mode when acting as a master. - 0: 7-bit addressing - 1: 10-bit addressing</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ADDR_7BITS</name>
                <description>Master 7Bit addressing mode</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ADDR_10BITS</name>
                <description>Master 10Bit addressing mode</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IC_10BITADDR_SLAVE</name>
            <description>When acting as a slave, this bit controls whether the DW_apb_i2c responds to 7- or 10-bit addresses. - 0: 7-bit addressing. The DW_apb_i2c ignores transactions that involve 10-bit addressing for 7-bit addressing, only the lower 7 bits of the IC_SAR register are compared. - 1: 10-bit addressing. The DW_apb_i2c responds to only 10-bit addressing transfers that match the full 10 bits of the IC_SAR register.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ADDR_7BITS</name>
                <description>Slave 7Bit addressing</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ADDR_10BITS</name>
                <description>Slave 10Bit addressing</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IC_RESTART_EN</name>
            <description>Determines whether RESTART conditions may be sent when acting as a master. Some older slaves do not support handling RESTART conditions however, RESTART conditions are used in several DW_apb_i2c operations. When RESTART is disabled, the master is prohibited from performing the following functions: - Sending a START BYTE - Performing any high-speed mode operation - High-speed mode operation - Performing direction changes in combined format mode - Performing a read operation with a 10-bit address By replacing RESTART condition followed by a STOP and a subsequent START condition, split operations are broken down into multiple DW_apb_i2c transfers. If the above operations are performed, it will result in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register.


 Reset value: ENABLED</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Master restart disabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Master restart enabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IC_SLAVE_DISABLE</name>
            <description>This bit controls whether I2C has its slave disabled, which means once the presetn signal is applied, then this bit is set and the slave is disabled.


 If this bit is set (slave is disabled), DW_apb_i2c functions only as a master and does not perform any action that requires a slave.


 NOTE: Software should ensure that if this bit is written with 0, then bit 0 should also be written with a 0.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>SLAVE_ENABLED</name>
                <description>Slave mode is enabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>SLAVE_DISABLED</name>
                <description>Slave mode is disabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>MASTER_MODE</name>
            <description>This bit controls whether the DW_apb_i2c master is enabled.


 NOTE: Software should ensure that if this bit is written with &apos;1&apos; then bit 6 should also be written with a &apos;1&apos;.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Master mode is disabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Master mode is enabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RX_FIFO_FULL_HLD_CTRL</name>
            <description>This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is physically full to its RX_BUFFER_DEPTH, as described in the IC_RX_FULL_HLD_BUS_EN parameter.


 Reset value: 0x0.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Overflow when RX_FIFO is full</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Hold bus when RX_FIFO is full</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>SPEED</name>
            <description>These bits control at which speed the DW_apb_i2c operates its setting is relevant only if one is operating the DW_apb_i2c in master mode. Hardware protects against illegal values being programmed by software. These bits must be programmed appropriately for slave mode also, as it is used to capture correct value of spike filter as per the speed mode.


 This register should be programmed only with a value in the range of 1 to IC_MAX_SPEED_MODE otherwise, hardware updates this register with the value of IC_MAX_SPEED_MODE.


