JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 1: standard mode (100 kbit/s)


 2: fast mode (&lt;=400 kbit/s) or fast mode plus (&lt;=1000Kbit/s)


 3: high speed mode (3.4 Mbit/s)


 Note: This field is not applicable when IC_ULTRA_FAST_MODE=1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>STANDARD</name>
                <description>Standard Speed mode of operation</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>FAST</name>
                <description>Fast or Fast Plus mode of operation</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>High Speed mode of operation</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>STOP_DET_IFADDRESSED</name>
            <description>In slave mode: - 1&apos;b1: issues the STOP_DET interrupt only when it is addressed. - 1&apos;b0: issues the STOP_DET irrespective of whether it&apos;s addressed or not. Reset value: 0x0


 NOTE: During a general call address, this slave does not issue the STOP_DET interrupt if STOP_DET_IF_ADDRESSED = 1&apos;b1, even if the slave responds to the general call address by generating ACK. The STOP_DET interrupt is generated only when the transmitted address matches the slave address (SAR).</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>slave issues STOP_DET intr always</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>slave issues STOP_DET intr only if addressed</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>STOP_DET_IF_MASTER_ACTIVE</name>
            <description>Master issues the STOP_DET interrupt irrespective of whether master is active or not</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX_EMPTY_CTRL</name>
            <description>This bit controls the generation of the TX_EMPTY interrupt, as described in the IC_RAW_INTR_STAT register.


 Reset value: 0x0.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Default behaviour of TX_EMPTY interrupt</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Controlled generation of TX_EMPTY interrupt</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_DATA_CMD</name>
        <description>I2C Rx/Tx Data Buffer and Command Register this is the register the CPU writes to when filling the TX FIFO and the CPU reads from when retrieving bytes from RX FIFO.


 The size of the register changes as follows:


 Write: - 11 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=1 - 9 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=0 Read: - 12 bits when IC_FIRST_DATA_BYTE_STATUS = 1 - 8 bits when IC_FIRST_DATA_BYTE_STATUS = 0 Note: In order for the DW_apb_i2c to continue acknowledging reads, a read command should be written for every byte that is to be received otherwise the DW_apb_i2c will stop acknowledging.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CMD</name>
            <description>This bit controls whether a read or a write is performed. This bit does not control the direction when the DW_apb_i2con acts as a slave. It controls only the direction when it acts as a master.


 When a command is entered in the TX FIFO, this bit distinguishes the write and read commands. In slave-receiver mode, this bit is a &apos;don&apos;t care&apos; because writes to this register are not required. In slave-transmitter mode, a &apos;0&apos; indicates that the data in IC_DATA_CMD is to be transmitted.


 When programming this bit, you should remember the following: attempting to perform a read operation after a General Call command has been sent results in a TX_ABRT interrupt (bit 6 of the IC_RAW_INTR_STAT register), unless bit 11 (SPECIAL) in the IC_TAR register has been cleared. If a &apos;1&apos; is written to this bit after receiving a RD_REQ interrupt, then a TX_ABRT interrupt occurs.


 Reset value: 0x0</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
            <enumeratedValues>
              <enumeratedValue>
                <name>WRITE</name>
                <description>Master Write Command</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>READ</name>
                <description>Master Read Command</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>DAT</name>
            <description>This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, bits 7:0 (DAT) are ignored by the DW_apb_i2c. However, when you read this register, these bits return the value of data received on the DW_apb_i2c interface.


