JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FIRST_DATA_BYTE</name>
            <description>Indicates the first data byte received after the address phase for receive transfer in Master receiver or Slave receiver mode.


 Reset value : 0x0


 NOTE: In case of APB_DATA_WIDTH=8,


 1. The user has to perform two APB Reads to IC_DATA_CMD in order to get status on 11 bit.


 2. In order to read the 11 bit, the user has to perform the first data byte read [7:0] (offset 0x10) and then perform the second read [15:8] (offset 0x11) in order to know the status of 11 bit (whether the data received in previous read is a first data byte or not).


 3. The 11th bit is an optional read field, user can ignore 2nd byte read [15:8] (offset 0x11) if not interested in FIRST_DATA_BYTE status.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>Sequential data byte received</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>Non sequential data byte received</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RESTART</name>
            <description>This bit controls whether a RESTART is issued before the byte is sent or received.


 1 - If IC_RESTART_EN is 1, a RESTART is issued before the data is sent/received (according to the value of CMD), regardless of whether or not the transfer direction is changing from the previous command if IC_RESTART_EN is 0, a STOP followed by a START is issued instead.


 0 - If IC_RESTART_EN is 1, a RESTART is issued only if the transfer direction is changing from the previous command if IC_RESTART_EN is 0, a STOP followed by a START is issued instead.


 Reset value: 0x0</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>Don&apos;t Issue RESTART before this command</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>Issue RESTART before this command</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>STOP</name>
            <description>This bit controls whether a STOP is issued after the byte is sent or received.


 - 1 - STOP is issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master immediately tries to start a new transfer by issuing a START and arbitrating for the bus. - 0 - STOP is not issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master continues the current transfer by sending/receiving data bytes according to the value of the CMD bit. If the Tx FIFO is empty, the master holds the SCL line low and stalls the bus until a new command is available in the Tx FIFO. Reset value: 0x0</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>Don&apos;t Issue STOP after this command</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>Issue STOP after this command</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_DMA_CR</name>
        <description>DMA Control Register


 The register is used to enable the DMA Controller interface operation. There is a separate bit for transmit and receive. This can be programmed regardless of the state of IC_ENABLE.</description>
        <addressOffset>0x88</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RDMAE</name>
            <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Receive FIFO DMA channel disabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Receive FIFO DMA channel enabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>TDMAE</name>
            <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. Reset value: 0x0</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>transmit FIFO DMA channel disabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Transmit FIFO DMA channel enabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_DMA_RDLR</name>
        <description>I2C Receive Data Level Register</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DMARDL</name>
            <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1 that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value + 1, and RDMAE =1. For instance, when DMARDL is 0, then dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO.


