JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>ACTIVITY interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>ACTIVITY interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_GEN_CALL</name>
            <description>This bit masks the R_GEN_CALL interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>GEN_CALL interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>GEN_CALL interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_MASTER_ON_HOLD_READ_ONLY</name>
            <description>This M_MASTER_ON_HOLD_read_only bit masks the R_MASTER_ON_HOLD interrupt in IC_INTR_STAT register.\n\n Reset value: 0x0</description>
            <bitOffset>13</bitOffset>
            <bitWidth>14</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>MASTER_ON_HOLD interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>MASTER_ON_HOLD interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RD_REQ</name>
            <description>This bit masks the R_RD_REQ interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RD_REQ interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RD_REQ interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RESTART_DET</name>
            <description>This bit masks the R_RESTART_DET interrupt in IC_INTR_STAT register.


 Reset value: 0x0</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RESTART_DET interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RESTART_DET interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RX_DONE</name>
            <description>This bit masks the R_RX_DONE interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RX_DONE interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RX_DONE interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RX_FULL</name>
            <description>This bit masks the R_RX_FULL interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RX_FULL interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RX_FULL interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RX_OVER</name>
            <description>This bit masks the R_RX_OVER interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RX_OVER interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RX_OVER interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_RX_UNDER</name>
            <description>This bit masks the R_RX_UNDER interrupt in IC_INTR_STAT register.


