JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>RX_UNDER interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>RX_UNDER interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_START_DET</name>
            <description>This bit masks the R_START_DET interrupt in IC_INTR_STAT register.


 Reset value: 0x0</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>START_DET interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>START_DET interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_STOP_DET</name>
            <description>This bit masks the R_STOP_DET interrupt in IC_INTR_STAT register.


 Reset value: 0x0</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>STOP_DET interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>STOP_DET interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_TX_ABRT</name>
            <description>This bit masks the R_TX_ABRT interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>TX_ABORT interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>TX_ABORT interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_TX_EMPTY</name>
            <description>This bit masks the R_TX_EMPTY interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>TX_EMPTY interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>TX_EMPTY interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>M_TX_OVER</name>
            <description>This bit masks the R_TX_OVER interrupt in IC_INTR_STAT register.


 Reset value: 0x1</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>TX_OVER interrupt is masked</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>TX_OVER interrupt is unmasked</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_INTR_STAT</name>
        <description>I2C Interrupt Status Register


 Each bit in this register has a corresponding mask bit in the IC_INTR_MASK register. These bits are cleared by reading the matching interrupt clear register. The unmasked raw versions of these bits are available in the IC_RAW_INTR_STAT register.</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>R_ACTIVITY</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY bit.


 Reset value: 0x0</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_ACTIVITY interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_ACTIVITY interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>R_GEN_CALL</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL bit.


