JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RD_REQ interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RD_REQ interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RESTART_DET</name>
            <description>Indicates whether a RESTART condition has occurred on the I2C interface when DW_apb_i2c is operating in Slave mode and the slave is being addressed. Enabled only when IC_SLV_RESTART_DET_EN=1.


 Note: However, in high-speed mode or during a START BYTE transfer, the RESTART comes before the address field as per the I2C protocol. In this case, the slave is not the addressed slave when the RESTART is issued, therefore DW_apb_i2c does not generate the RESTART_DET interrupt.


 Reset value: 0x0</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RESTART_DET interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RESTART_DET interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RX_DONE</name>
            <description>When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done.


 Reset value: 0x0</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RX_DONE interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RX_DONE interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RX_FULL</name>
            <description>Set when the receive buffer reaches or goes above the RX_TL threshold in the IC_RX_TL register. It is automatically cleared by hardware when buffer level goes below the threshold. If the module is disabled (IC_ENABLE[0]=0), the RX FIFO is flushed and held in reset therefore the RX FIFO is not full. So this bit is cleared once the IC_ENABLE bit 0 is programmed with a 0, regardless of the activity that continues.


 Reset value: 0x0</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RX_FULL interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RX_FULL interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RX_OVER</name>
            <description>Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an additional byte is received from an external I2C device. The DW_apb_i2c acknowledges this, but any data bytes received after the FIFO is full are lost. If the module is disabled (IC_ENABLE[0]=0), this bit keeps its level until the master or slave state machines go into idle, and when ic_en goes to 0, this interrupt is cleared.


 Note: If bit 9 of the IC_CON register (RX_FIFO_FULL_HLD_CTRL) is programmed to HIGH, then the RX_OVER interrupt never occurs, because the Rx FIFO never overflows.


 Reset value: 0x0</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RX_OVER interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RX_OVER interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RX_UNDER</name>
            <description>Set if the processor attempts to read the receive buffer when it is empty by reading from the IC_DATA_CMD register. If the module is disabled (IC_ENABLE[0]=0), this bit keeps its level until the master or slave state machines go into idle, and when ic_en goes to 0, this interrupt is cleared.


 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RX_UNDER interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RX_UNDER interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>START_DET</name>
            <description>Indicates whether a START or RESTART condition has occurred on the I2C interface regardless of whether DW_apb_i2c is operating in slave or master mode.


