JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Role of DW_apb_i2c: Master</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_HS_ACK_VOID</name>
                <description>HS Master code ACKed in HS Mode- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_HS_ACK_GENERATED</name>
                <description>HS Master code ACKed in HS Mode</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_HS_NORSTRT</name>
            <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to use the master to transfer data in High Speed mode.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Master-Receiver</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_HS_NORSTRT_VOID</name>
                <description>User trying to switch Master to HS mode when RESTART disabled- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_HS_NORSTRT_GENERATED</name>
                <description>User trying to switch Master to HS mode when RESTART disabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_MASTER_DIS</name>
            <description>This field indicates that the User tries to initiate a Master operation with the Master mode disabled.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Master-Receiver</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_MASTER_DIS_VOID</name>
                <description>User initiating master operation when MASTER disabled- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_MASTER_DIS_GENERATED</name>
                <description>User initiating master operation when MASTER disabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_SBYTE_ACKDET</name>
            <description>This field indicates that the Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).


 Reset value: 0x0


 Role of DW_apb_i2c: Master</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_SBYTE_ACKDET_VOID</name>
                <description>ACK detected for START byte- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_SBYTE_ACKDET_GENERATED</name>
                <description>ACK detected for START byte</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_SBYTE_NORSTRT</name>
            <description>To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first restart must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]). Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, bit 9 clears for one cycle and then gets reasserted. When this field is set to 1, the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to send a START Byte.


 Reset value: 0x0


 Role of DW_apb_i2c: Master</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_SBYTE_NORSTRT_VOID</name>
                <description>User trying to send START byte when RESTART disabled- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_SBYTE_NORSTRT_GENERATED</name>
                <description>User trying to send START byte when RESTART disabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_SLVFLUSH_TXFIFO</name>
            <description>This field specifies that the Slave has received a read command and some data exists in the TX FIFO, so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.


 Reset value: 0x0


 Role of DW_apb_i2c: Slave-Transmitter</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_SLVFLUSH_TXFIFO_VOID</name>
                <description>Slave flushes existing data in TX-FIFO upon getting read command- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_SLVFLUSH_TXFIFO_GENERATED</name>
                <description>Slave flushes existing data in TX-FIFO upon getting read command</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_SLVRD_INTX</name>
            <description>1: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user writes a 1 in CMD (bit 8) of IC_DATA_CMD register.


 Reset value: 0x0


