JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>DW_apb_i2c address block


 List of configuration constants for the Synopsys I2C hardware (you may see references to these in I2C register header these are *fixed* values, set at hardware design time):


 IC_ULTRA_FAST_MODE ................ 0x0

 IC_UFM_TBUF_CNT_DEFAULT ........... 0x8

 IC_UFM_SCL_LOW_COUNT .............. 0x0008

 IC_UFM_SCL_HIGH_COUNT ............. 0x0006

 IC_TX_TL .......................... 0x0

 IC_TX_CMD_BLOCK ................... 0x1

 IC_HAS_DMA ........................ 0x1

 IC_HAS_ASYNC_FIFO ................. 0x0

 IC_SMBUS_ARP ...................... 0x0

 IC_FIRST_DATA_BYTE_STATUS ......... 0x1

 IC_INTR_IO ........................ 0x1

 IC_MASTER_MODE .................... 0x1

 IC_DEFAULT_ACK_GENERAL_CALL ....... 0x1

 IC_INTR_POL ....................... 0x1

 IC_OPTIONAL_SAR ................... 0x0

 IC_DEFAULT_TAR_SLAVE_ADDR ......... 0x055

 IC_DEFAULT_SLAVE_ADDR ............. 0x055

 IC_DEFAULT_HS_SPKLEN .............. 0x1

 IC_FS_SCL_HIGH_COUNT .............. 0x0006

 IC_HS_SCL_LOW_COUNT ............... 0x0008

 IC_DEVICE_ID_VALUE ................ 0x0

 IC_10BITADDR_MASTER ............... 0x0

 IC_CLK_FREQ_OPTIMIZATION .......... 0x0

 IC_DEFAULT_FS_SPKLEN .............. 0x7

 IC_ADD_ENCODED_PARAMS ............. 0x0

 IC_DEFAULT_SDA_HOLD ............... 0x000001

 IC_DEFAULT_SDA_SETUP .............. 0x64

 IC_AVOID_RX_FIFO_FLUSH_ON_TX_ABRT . 0x0

 IC_CLOCK_PERIOD ................... 100

 IC_EMPTYFIFO_HOLD_MASTER_EN ....... 1

 IC_RESTART_EN ..................... 0x1

 IC_TX_CMD_BLOCK_DEFAULT ........... 0x0

 IC_BUS_CLEAR_FEATURE .............. 0x0

 IC_CAP_LOADING .................... 100

 IC_FS_SCL_LOW_COUNT ............... 0x000d

 APB_DATA_WIDTH .................... 32

 IC_SDA_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff

 IC_SLV_DATA_NACK_ONLY ............. 0x1

 IC_10BITADDR_SLAVE ................ 0x0

 IC_CLK_TYPE ....................... 0x0

 IC_SMBUS_UDID_MSB ................. 0x0

 IC_SMBUS_SUSPEND_ALERT ............ 0x0

 IC_HS_SCL_HIGH_COUNT .............. 0x0006

 IC_SLV_RESTART_DET_EN ............. 0x1

 IC_SMBUS .......................... 0x0

 IC_OPTIONAL_SAR_DEFAULT ........... 0x0

 IC_PERSISTANT_SLV_ADDR_DEFAULT .... 0x0

 IC_USE_COUNTS ..................... 0x0

 IC_RX_BUFFER_DEPTH ................ 16

 IC_SCL_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff

 IC_RX_FULL_HLD_BUS_EN ............. 0x1

 IC_SLAVE_DISABLE .................. 0x1

 IC_RX_TL .......................... 0x0

 IC_DEVICE_ID ...................... 0x0

 IC_HC_COUNT_VALUES ................ 0x0

 I2C_DYNAMIC_TAR_UPDATE ............ 0

 IC_SMBUS_CLK_LOW_MEXT_DEFAULT ..... 0xffffffff

 IC_SMBUS_CLK_LOW_SEXT_DEFAULT ..... 0xffffffff

 IC_HS_MASTER_CODE ................. 0x1

 IC_SMBUS_RST_IDLE_CNT_DEFAULT ..... 0xffff

 IC_SMBUS_UDID_LSB_DEFAULT ......... 0xffffffff

 IC_SS_SCL_HIGH_COUNT .............. 0x0028

 IC_SS_SCL_LOW_COUNT ............... 0x002f

 IC_MAX_SPEED_MODE ................. 0x2

 IC_STAT_FOR_CLK_STRETCH ........... 0x0

 IC_STOP_DET_IF_MASTER_ACTIVE ...... 0x0

 IC_DEFAULT_UFM_SPKLEN ............. 0x1

 IC_TX_BUFFER_DEPTH ................ 16</description>
      <groupName>I2C0</groupName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>I2C1_IRQ</name>
        <value>24</value>
      </interrupt>
      <registers>
      <register>
        <name>IC_ACK_GENERAL_CALL</name>
        <description>I2C ACK General Call Register


 The register controls whether DW_apb_i2c responds with a ACK or NACK when it receives an I2C General Call address.


 This register is applicable only when the DW_apb_i2c is in slave mode.</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ACK_GEN_CALL</name>
            <description>ACK General Call. When set to 1, DW_apb_i2c responds with a ACK (by asserting ic_data_oe) when it receives a General Call. Otherwise, DW_apb_i2c responds with a NACK (by negating ic_data_oe).</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Generate NACK for a General Call</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Generate ACK for a General Call</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_CLR_ACTIVITY</name>
        <description>Clear ACTIVITY Interrupt Register</description>
        <addressOffset>0x5C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLR_ACTIVITY</name>
            <description>Reading this register clears the ACTIVITY interrupt if the I2C is not active anymore. If the I2C module is still active on the bus, the ACTIVITY interrupt bit continues to be set. It is automatically cleared by hardware if the module is disabled and if there is no further activity on the bus. The value read from this register to get status of the ACTIVITY interrupt (bit 8) of the IC_RAW_INTR_STAT register.


 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_CLR_GEN_CALL</name>
        <description>Clear GEN_CALL Interrupt Register</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLR_GEN_CALL</name>
            <description>Read this register to clear the GEN_CALL interrupt (bit 11) of IC_RAW_INTR_STAT register.


