JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_START_DET interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_START_DET interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>R_STOP_DET</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET bit.


 Reset value: 0x0</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_STOP_DET interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_STOP_DET interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>R_TX_ABRT</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT bit.


 Reset value: 0x0</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_TX_ABRT interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_TX_ABRT interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>R_TX_EMPTY</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY bit.


 Reset value: 0x0</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_TX_EMPTY interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_TX_EMPTY interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>R_TX_OVER</name>
            <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_OVER bit.


 Reset value: 0x0</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>R_TX_OVER interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>R_TX_OVER interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_RAW_INTR_STAT</name>
        <description>I2C Raw Interrupt Status Register


 Unlike the IC_INTR_STAT register, these bits are not masked so they always show the true status of the DW_apb_i2c.</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ACTIVITY</name>
            <description>This bit captures DW_apb_i2c activity and stays set until it is cleared. There are four ways to clear it: - Disabling the DW_apb_i2c - Reading the IC_CLR_ACTIVITY register - Reading the IC_CLR_INTR register - System reset Once this bit is set, it stays set unless one of the four methods is used to clear it. Even if the DW_apb_i2c module is idle, this bit remains set until cleared, indicating that there was activity on the bus.


 Reset value: 0x0</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>RAW_INTR_ACTIVITY interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>RAW_INTR_ACTIVITY interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>GEN_CALL</name>
            <description>Set only when a General Call address is received and it is acknowledged. It stays set until it is cleared either by disabling DW_apb_i2c or when the CPU reads bit 0 of the IC_CLR_GEN_CALL register. DW_apb_i2c stores the received data in the Rx buffer.


 Reset value: 0x0</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>GEN_CALL interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>GEN_CALL interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>MASTER_ON_HOLD</name>
            <description>Indicates whether master is holding the bus and TX FIFO is empty. Enabled only when I2C_DYNAMIC_TAR_UPDATE=1 and IC_EMPTYFIFO_HOLD_MASTER_EN=1.\n\n Reset value: 0x0</description>
            <bitOffset>13</bitOffset>
            <bitWidth>14</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>MASTER_ON_HOLD interrupt is inactive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>MASTER_ON_HOLD interrupt is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>RD_REQ</name>
            <description>This bit is set to 1 when DW_apb_i2c is acting as a slave and another I2C master is attempting to read data from DW_apb_i2c. The DW_apb_i2c holds the I2C bus in a wait state (SCL=0) until this interrupt is serviced, which means that the slave has been addressed by a remote master that is asking for data to be transferred. The processor must respond to this interrupt and then write the requested data to the IC_DATA_CMD register. This bit is set to 0 just after the processor reads the IC_CLR_RD_REQ register.


