JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 A write can occur on this register if both of the following conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note: The IC_STATUS[6] is a register read-back location for the internal slv_activity signal the user should poll this before writing the ic_slv_data_nack_only bit.</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>NACK</name>
            <description>Generate NACK. This NACK generation only occurs when DW_apb_i2c is a slave-receiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received hence, the data transfer is aborted and the data received is not pushed to the receive buffer.


 When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria. - 1: generate NACK after data byte received - 0: generate NACK/ACK normally Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLED</name>
                <description>Slave receiver generates NACK normally</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLED</name>
                <description>Slave receiver generates NACK upon data reception only</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_SS_SCL_HCNT</name>
        <description>Standard Speed I2C Clock SCL High Count Register</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x28</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IC_SS_SCL_HCNT</name>
            <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for standard speed. For more information, refer to &apos;IC_CLK Frequency Configuration&apos;.


 This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.


 The minimum valid value is 6 hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.


 NOTE: This register must not be programmed to a value higher than 65525, because DW_apb_i2c uses a 16-bit counter to flag an I2C bus idle condition when this counter reaches a value of IC_SS_SCL_HCNT + 10.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_SS_SCL_LCNT</name>
        <description>Standard Speed I2C Clock SCL Low Count Register</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IC_SS_SCL_LCNT</name>
            <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for standard speed. For more information, refer to &apos;IC_CLK Frequency Configuration&apos;


 This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.


 The minimum valid value is 8 hardware prevents values less than this being written, and if attempted, results in 8 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of DW_apb_i2c. The lower byte must be programmed first, and then the upper byte is programmed.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_STATUS</name>
        <description>I2C Status Register


 This is a read-only register used to indicate the current transfer status and FIFO status. The status register may be read at any time. None of the bits in this register request an interrupt.


 When the I2C is disabled by writing 0 in bit 0 of the IC_ENABLE register: - Bits 1 and 2 are set to 1 - Bits 3 and 10 are set to 0 When the master or slave state machines goes to idle and ic_en=0: - Bits 5 and 6 are set to 0</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x6</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ACTIVITY</name>
            <description>I2C Activity Status. Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>I2C is idle</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>I2C is active</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>MST_ACTIVITY</name>
            <description>Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in the IDLE state, this bit is set. - 0: Master FSM is in IDLE state so the Master part of DW_apb_i2c is not Active - 1: Master FSM is not in IDLE state so the Master part of DW_apb_i2c is Active Note: IC_STATUS[0]-that is, ACTIVITY bit-is the OR of SLV_ACTIVITY and MST_ACTIVITY bits.


