JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reset value: 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_TX_ABRT_SOURCE</name>
        <description>I2C Transmit Abort Source Register


 This register has 32 bits that indicate the source of the TX_ABRT bit. Except for Bit 9, this register is cleared whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR register is read. To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first RESTART must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]).


 Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, Bit 9 clears for one cycle and is then re-asserted.</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ABRT_10ADDR1_NOACK</name>
            <description>This field indicates that the Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Master-Receiver</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>This abort is not generated</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>Byte 1 of 10Bit Address not ACKed by any slave</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_10ADDR2_NOACK</name>
            <description>This field indicates that the Master is in 10-bit address mode and that the second address byte of the 10-bit address was not acknowledged by any slave.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Master-Receiver</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>This abort is not generated</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>Byte 2 of 10Bit Address not ACKed by any slave</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_10B_RD_NORSTRT</name>
            <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the master sends a read command in 10-bit addressing mode.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Receiver</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_10B_RD_VOID</name>
                <description>Master not trying to read in 10Bit addressing mode when RESTART disabled</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_10B_RD_GENERATED</name>
                <description>Master trying to read in 10Bit addressing mode when RESTART disabled</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_7B_ADDR_NOACK</name>
            <description>This field indicates that the Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Master-Receiver</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>INACTIVE</name>
                <description>This abort is not generated</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ACTIVE</name>
                <description>This abort is generated because of NOACK for 7-bit address</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_GCALL_NOACK</name>
            <description>This field indicates that DW_apb_i2c in master mode has sent a General Call and no slave on the bus acknowledged the General Call.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_GCALL_NOACK_VOID</name>
                <description>GCALL not ACKed by any slave-scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_GCALL_NOACK_GENERATED</name>
                <description>GCALL not ACKed by any slave</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_GCALL_READ</name>
            <description>This field indicates that DW_apb_i2c in the master mode has sent a General Call but the user programmed the byte following the General Call to be a read from the bus (IC_DATA_CMD[9] is set to 1).


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_GCALL_READ_VOID</name>
                <description>GCALL is followed by read from bus-scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_GCALL_READ_GENERATED</name>
                <description>GCALL is followed by read from bus</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_HS_ACKDET</name>
            <description>This field indicates that the Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).


 Reset value: 0x0


