JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Role of DW_apb_i2c: Slave-Transmitter</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_SLVRD_INTX_VOID</name>
                <description>Slave trying to transmit to remote master in read mode- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_SLVRD_INTX_GENERATED</name>
                <description>Slave trying to transmit to remote master in read mode</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_SLV_ARBLOST</name>
            <description>This field indicates that a Slave has lost the bus while transmitting data to a remote master. IC_TX_ABRT_SOURCE[12] is set at the same time. Note: Even though the slave never &apos;owns&apos; the bus, something could go wrong on the bus. This is a fail safe check. For instance, during a data transmission at the low-to-high transition of SCL, if what is on the data bus is not what is supposed to be transmitted, then DW_apb_i2c no longer own the bus.


 Reset value: 0x0


 Role of DW_apb_i2c: Slave-Transmitter</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_SLV_ARBLOST_VOID</name>
                <description>Slave lost arbitration to remote master- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_SLV_ARBLOST_GENERATED</name>
                <description>Slave lost arbitration to remote master</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_TXDATA_NOACK</name>
            <description>This field indicates the master-mode only bit. When the master receives an acknowledgement for the address, but when it sends data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_TXDATA_NOACK_VOID</name>
                <description>Transmitted data non-ACKed by addressed slave-scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_TXDATA_NOACK_GENERATED</name>
                <description>Transmitted data not ACKed by addressed slave</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ABRT_USER_ABRT</name>
            <description>This is a master-mode-only bit. Master has detected the transfer abort (IC_ENABLE[1])


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_USER_ABRT_VOID</name>
                <description>Transfer abort detected by master- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_USER_ABRT_GENERATED</name>
                <description>Transfer abort detected by master</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>ARB_LOST</name>
            <description>This field specifies that the Master has lost arbitration, or if IC_TX_ABRT_SOURCE[14] is also set, then the slave transmitter has lost arbitration.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Slave-Transmitter</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>ABRT_LOST_VOID</name>
                <description>Master or Slave-Transmitter lost arbitration- scenario not present</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ABRT_LOST_GENERATED</name>
                <description>Master or Slave-Transmitter lost arbitration</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>TX_FLUSH_CNT</name>
            <description>This field indicates the number of Tx FIFO Data Commands which are flushed due to TX_ABRT interrupt. It is cleared whenever I2C is disabled.


 Reset value: 0x0


 Role of DW_apb_i2c: Master-Transmitter or Slave-Transmitter</description>
            <bitOffset>23</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IC_TX_TL</name>
        <description>I2C Transmit FIFO Threshold Register</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>TX_TL</name>
            <description>Transmit FIFO Threshold Level.


 Controls the level of entries (or below) that trigger the TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that it may not be set to value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 0 entries, and a value of 255 sets the threshold for 255 entries.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
