JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 31 == NULL</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>spi1_sclk</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>uart1_cts</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>i2c1_sda</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>null</name>
                <description>None</description>
                <value>31</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pwm_a_5</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sio_26</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pio0_26</name>
                <description>None</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pio1_26</name>
                <description>None</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>usb_muxing_vbus_en</name>
                <description>None</description>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INOVER</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the peri input</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the peri input</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive peri input low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive peri input high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IRQOVER</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the interrupt</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the interrupt</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive interrupt low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive interrupt high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OEOVER</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output enable from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>disable output</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>enable output</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OUTOVER</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive output low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive output high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO26_STATUS</name>
        <description>GPIO status</description>
        <addressOffset>0xD0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INFROMPAD</name>
            <description>input signal from pad, before override is applied</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INTOPERI</name>
            <description>input signal to peripheral, after override is applied</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQFROMPAD</name>
            <description>interrupt from pad before override is applied</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQTOPROC</name>
            <description>interrupt to processors, after override is applied</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OEFROMPERI</name>
            <description>output enable from selected peripheral, before register override is applied</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OETOPAD</name>
            <description>output enable to pad after register override is applied</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTFROMPERI</name>
            <description>output signal from selected peripheral, before register override is applied</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTTOPAD</name>
            <description>output signal to pad after register override is applied</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO27_CTRL</name>
        <description>GPIO control including function select and overrides.</description>
        <addressOffset>0xDC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FUNCSEL</name>
            <description>0-31 -&gt; selects pin function according to the gpio table

 31 == NULL</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>spi1_tx</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>uart1_rts</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>i2c1_scl</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>null</name>
                <description>None</description>
                <value>31</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pwm_b_5</name>
                <description>None</description>
                <value>4</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sio_27</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pio0_27</name>
                <description>None</description>
                <value>6</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>pio1_27</name>
                <description>None</description>
                <value>7</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>usb_muxing_overcurr_detect</name>
                <description>None</description>
                <value>9</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INOVER</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the peri input</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the peri input</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive peri input low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive peri input high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IRQOVER</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the interrupt</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the interrupt</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive interrupt low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive interrupt high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OEOVER</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output enable from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>disable output</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>enable output</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OUTOVER</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive output low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive output high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO27_STATUS</name>
        <description>GPIO status</description>
        <addressOffset>0xD8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INFROMPAD</name>
            <description>input signal from pad, before override is applied</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INTOPERI</name>
            <description>input signal to peripheral, after override is applied</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQFROMPAD</name>
            <description>interrupt from pad before override is applied</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQTOPROC</name>
            <description>interrupt to processors, after override is applied</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OEFROMPERI</name>
            <description>output enable from selected peripheral, before register override is applied</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OETOPAD</name>
            <description>output enable to pad after register override is applied</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTFROMPERI</name>
            <description>output signal from selected peripheral, before register override is applied</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTTOPAD</name>
            <description>output signal to pad after register override is applied</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO28_CTRL</name>
        <description>GPIO control including function select and overrides.</description>
        <addressOffset>0xE4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FUNCSEL</name>
            <description>0-31 -&gt; selects pin function according to the gpio table

