JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 31 == NULL</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>xip_ss_n</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>null</name>
                <description>None</description>
                <value>31</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>sio_31</name>
                <description>None</description>
                <value>5</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INOVER</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the peri input</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the peri input</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive peri input low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive peri input high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IRQOVER</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>don&apos;t invert the interrupt</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>invert the interrupt</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive interrupt low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive interrupt high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OEOVER</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output enable from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>disable output</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>enable output</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>OUTOVER</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NORMAL</name>
                <description>drive output from peripheral signal selected by funcsel</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>INVERT</name>
                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>LOW</name>
                <description>drive output low</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>drive output high</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_QSPI_SS_STATUS</name>
        <description>GPIO status</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INFROMPAD</name>
            <description>input signal from pad, before override is applied</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INTOPERI</name>
            <description>input signal to peripheral, after override is applied</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQFROMPAD</name>
            <description>interrupt from pad before override is applied</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IRQTOPROC</name>
            <description>interrupt to processors, after override is applied</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OEFROMPERI</name>
            <description>output enable from selected peripheral, before register override is applied</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OETOPAD</name>
            <description>output enable to pad after register override is applied</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTFROMPERI</name>
            <description>output signal from selected peripheral, before register override is applied</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OUTTOPAD</name>
            <description>output signal to pad after register override is applied</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_LOW</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PROC0_INTE</name>
        <description>Interrupt Enable for proc0</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_LOW</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PROC0_INTF</name>
        <description>Interrupt Force for proc0</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_HIGH</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_EDGE_LOW</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_HIGH</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SCLK_LEVEL_LOW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_HIGH</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_EDGE_LOW</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_HIGH</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD0_LEVEL_LOW</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_HIGH</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_EDGE_LOW</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_HIGH</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD1_LEVEL_LOW</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_HIGH</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_EDGE_LOW</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_HIGH</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD2_LEVEL_LOW</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_HIGH</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_EDGE_LOW</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_HIGH</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SD3_LEVEL_LOW</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_HIGH</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_EDGE_LOW</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_HIGH</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>GPIO_QSPI_SS_LEVEL_LOW</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
