JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>GPIO23</name>
        <description>Pad control register</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO24</name>
        <description>Pad control register</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO25</name>
        <description>Pad control register</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO26</name>
        <description>Pad control register</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO27</name>
        <description>Pad control register</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO28</name>
        <description>Pad control register</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO29</name>
        <description>Pad control register</description>
        <addressOffset>0x78</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO3</name>
        <description>Pad control register</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x56</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DRIVE</name>
            <description>Drive strength.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>2mA</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4mA</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8mA</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>12mA</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>IE</name>
            <description>Input enable</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OD</name>
            <description>Output disable. Has priority over output enable from peripherals</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PDE</name>
            <description>Pull down enable</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUE</name>
            <description>Pull up enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCHMITT</name>
            <description>Enable schmitt trigger</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEWFAST</name>
            <description>Slew rate control. 1 = Fast, 0 = Slow</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
