JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PIO0</name>
      <description>Programmable IO block</description>
      <groupName>PIO0</groupName>
      <baseAddress>0x50200000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>PIO0_IRQ_0</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>PIO0_IRQ_1</name>
        <value>8</value>
      </interrupt>
      <registers>
      <register>
        <name>CTRL</name>
        <description>PIO control register</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLKDIV_RESTART</name>
            <description>Restart a state machine&apos;s clock divider from an initial phase of 0. Clock dividers are free-running, so once started, their output (including fractional jitter) is completely determined by the integer/fractional divisor configured in SMx_CLKDIV. This means that, if multiple clock dividers with the same divisor are restarted simultaneously, by writing multiple 1 bits to this field, the execution clocks of those state machines will run in precise lockstep.


 Note that setting/clearing SM_ENABLE does not stop the clock divider from running, so once multiple state machines&apos; clocks are synchronised, it is safe to disable/reenable a state machine, whilst keeping the clock dividers in sync.


 Note also that CLKDIV_RESTART can be written to whilst the state machine is running, and this is useful to resynchronise clock dividers after the divisors (SMx_CLKDIV) have been changed on-the-fly.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>SM_ENABLE</name>
            <description>Enable/disable each of the four state machines by writing 1/0 to each of these four bits. When disabled, a state machine will cease executing instructions, except those written directly to SMx_INSTR by the system. Multiple bits can be set/cleared at once to run/halt multiple state machines simultaneously.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM_RESTART</name>
            <description>Write 1 to instantly clear internal SM state which may be otherwise difficult to access and will affect future execution.


 Specifically, the following are cleared: input and output shift counters the contents of the input shift register the delay counter the waiting-on-IRQ state any stalled instruction written to SMx_INSTR or run by OUT/MOV EXEC any pin write left asserted due to OUT_STICKY.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>DBG_CFGINFO</name>
        <description>The PIO hardware has some free parameters that may vary between chip products.

 These should be provided in the chip datasheet, but are also exposed here.</description>
        <addressOffset>0x44</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO_DEPTH</name>
            <description>The depth of the state machine TX/RX FIFOs, measured in words.

 Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double

 this depth.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IMEM_SIZE</name>
            <description>The size of the instruction memory, measured in units of one instruction</description>
            <bitOffset>16</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM_COUNT</name>
            <description>The number of state machines this PIO instance is equipped with.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DBG_PADOE</name>
        <description>Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DBG_PADOUT</name>
        <description>Read to sample the pad output values PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>FDEBUG</name>
        <description>FIFO debug register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXSTALL</name>
            <description>State machine has stalled on full RX FIFO during a blocking PUSH, or an IN with autopush enabled. This flag is also set when a nonblocking PUSH to a full FIFO took place, in which case the state machine has dropped data. Write 1 to clear.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>RXUNDER</name>
            <description>RX FIFO underflow (i.e. read-on-empty by the system) has occurred. Write 1 to clear. Note that read-on-empty does not perturb the state of the FIFO in any way, but the data returned by reading from an empty FIFO is undefined, so this flag generally only becomes set due to some kind of software error.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>TXOVER</name>
            <description>TX FIFO overflow (i.e. write-on-full by the system) has occurred. Write 1 to clear. Note that write-on-full does not alter the state or contents of the FIFO in any way, but the data that the system attempted to write is dropped, so if this flag is set, your software has quite likely dropped some data on the floor.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>TXSTALL</name>
            <description>State machine has stalled on empty TX FIFO during a blocking PULL, or an OUT with autopull enabled. Write 1 to clear.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>FLEVEL</name>
        <description>FIFO levels</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RX0</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RX1</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RX2</name>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RX3</name>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX2</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TX3</name>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FSTAT</name>
        <description>FIFO status register</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xF000F00</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXEMPTY</name>
            <description>State machine RX FIFO is empty</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXFULL</name>
            <description>State machine RX FIFO is full</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXEMPTY</name>
            <description>State machine TX FIFO is empty</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXFULL</name>
            <description>State machine TX FIFO is full</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INPUT_SYNC_BYPASS</name>
        <description>There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO.

 0 -&gt; input is synchronized (default)

 1 -&gt; synchronizer is bypassed

 If in doubt, leave this register as all zeroes.</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INSTR_MEM0</name>
        <description>Write-only access to instruction memory location 0</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM1</name>
        <description>Write-only access to instruction memory location 1</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM10</name>
        <description>Write-only access to instruction memory location 10</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM10</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM11</name>
        <description>Write-only access to instruction memory location 11</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM11</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM12</name>
        <description>Write-only access to instruction memory location 12</description>
        <addressOffset>0x78</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM12</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM13</name>
        <description>Write-only access to instruction memory location 13</description>
        <addressOffset>0x7C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM13</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM14</name>
        <description>Write-only access to instruction memory location 14</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM14</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM15</name>
        <description>Write-only access to instruction memory location 15</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM15</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM16</name>
        <description>Write-only access to instruction memory location 16</description>
        <addressOffset>0x88</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM16</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM17</name>
        <description>Write-only access to instruction memory location 17</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM17</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM18</name>
        <description>Write-only access to instruction memory location 18</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM18</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM19</name>
        <description>Write-only access to instruction memory location 19</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM19</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM2</name>
        <description>Write-only access to instruction memory location 2</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM20</name>
        <description>Write-only access to instruction memory location 20</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM20</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM21</name>
        <description>Write-only access to instruction memory location 21</description>
        <addressOffset>0x9C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM21</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM22</name>
        <description>Write-only access to instruction memory location 22</description>
        <addressOffset>0xA0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM22</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM23</name>
        <description>Write-only access to instruction memory location 23</description>
        <addressOffset>0xA4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM23</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM24</name>
        <description>Write-only access to instruction memory location 24</description>
        <addressOffset>0xA8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM24</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM25</name>
        <description>Write-only access to instruction memory location 25</description>
        <addressOffset>0xAC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM25</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM26</name>
        <description>Write-only access to instruction memory location 26</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM26</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
