JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 RX FIFO is disabled as a result (always reads as both full and empty).

 FIFOs are flushed when this bit is changed.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IN_SHIFTDIR</name>
            <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_SHIFTDIR</name>
            <description>1 = shift out of output shift register to right. 0 = to left.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PULL_THRESH</name>
            <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place.

 Write 0 for value of 32.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUSH_THRESH</name>
            <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place.

 Write 0 for value of 32.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_ADDR</name>
        <description>Current instruction address of state machine 1</description>
        <addressOffset>0xEC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM1_ADDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_CLKDIV</name>
        <description>Clock divisor register for state machine 1

 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
        <addressOffset>0xE0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x10000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <description>Fractional part of clock divisor</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <description>Effective frequency is sysclk/(int + frac/256).

 Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_EXECCTRL</name>
        <description>Execution/behavioural settings for state machine 1</description>
        <addressOffset>0xE4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1F000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EXEC_STALLED</name>
            <description>If 1, an instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear to 0 once this instruction completes.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>INLINE_OUT_EN</name>
            <description>If 1, use a bit of OUT data as an auxiliary write enable

 When used in conjunction with OUT_STICKY, writes with an enable of 0 will

 deassert the latest pin write. This can create useful masking/override behaviour

 due to the priority ordering of state machine pin writes (SM0 &lt; SM1 &lt; ...)</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>JMP_PIN</name>
            <description>The GPIO number to use as condition for JMP PIN. Unaffected by input mapping.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_EN_SEL</name>
            <description>Which data bit to use for inline OUT enable</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_STICKY</name>
            <description>Continuously assert the most recent OUT/SET to the pins</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIDE_EN</name>
            <description>If 1, the MSB of the Delay/Side-set instruction field is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction, but the maximum possible side-set width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUNT is inclusive of this enable bit.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIDE_PINDIR</name>
            <description>If 1, side-set data is asserted to pin directions, instead of pin values</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STATUS_N</name>
            <description>Comparison level for the MOV x, STATUS instruction</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STATUS_SEL</name>
            <description>Comparison used for the MOV x, STATUS instruction.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>TXLEVEL</name>
                <description>All-ones if TX FIFO level &lt; N, otherwise all-zeroes</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RXLEVEL</name>
                <description>All-ones if RX FIFO level &lt; N, otherwise all-zeroes</description>
                <value>1</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>WRAP_BOTTOM</name>
            <description>After reaching wrap_top, execution is wrapped to this address.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>WRAP_TOP</name>
            <description>After reaching this address, execution is wrapped to wrap_bottom.

 If the instruction is a jump, and the jump condition is true, the jump takes priority.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_INSTR</name>
        <description>Read to see the instruction currently addressed by state machine 1&apos;s program counter

 Write to execute an instruction immediately (including jumps) and then resume execution.</description>
        <addressOffset>0xF0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM1_INSTR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_PINCTRL</name>
        <description>State machine pin control</description>
        <addressOffset>0xF4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x14000000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IN_BASE</name>
            <description>The pin which is mapped to the least-significant bit of a state machine&apos;s IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_BASE</name>
            <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_COUNT</name>
            <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SET_BASE</name>
            <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SET_COUNT</name>
            <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
            <bitOffset>26</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIDESET_BASE</name>
            <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction&apos;s side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIDESET_COUNT</name>
            <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
            <bitOffset>29</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SM1_SHIFTCTRL</name>
        <description>Control behaviour of the input/output shift registers for state machine 1</description>
        <addressOffset>0xE8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xC0000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>AUTOPULL</name>
            <description>Pull automatically when the output shift register is emptied, i.e. on or following an OUT instruction which causes the output shift counter to reach or exceed PULL_THRESH.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AUTOPUSH</name>
            <description>Push automatically when the input shift register is filled, i.e. on an IN instruction which causes the input shift counter to reach or exceed PUSH_THRESH.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FJOIN_RX</name>
            <description>When 1, RX FIFO steals the TX FIFO&apos;s storage, and becomes twice as deep.

 TX FIFO is disabled as a result (always reads as both full and empty).

 FIFOs are flushed when this bit is changed.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FJOIN_TX</name>
            <description>When 1, TX FIFO steals the RX FIFO&apos;s storage, and becomes twice as deep.

