JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>INSTR_MEM20</name>
        <description>Write-only access to instruction memory location 20</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM20</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM21</name>
        <description>Write-only access to instruction memory location 21</description>
        <addressOffset>0x9C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM21</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM22</name>
        <description>Write-only access to instruction memory location 22</description>
        <addressOffset>0xA0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM22</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM23</name>
        <description>Write-only access to instruction memory location 23</description>
        <addressOffset>0xA4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM23</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM24</name>
        <description>Write-only access to instruction memory location 24</description>
        <addressOffset>0xA8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM24</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM25</name>
        <description>Write-only access to instruction memory location 25</description>
        <addressOffset>0xAC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM25</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM26</name>
        <description>Write-only access to instruction memory location 26</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM26</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM27</name>
        <description>Write-only access to instruction memory location 27</description>
        <addressOffset>0xB4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM27</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM28</name>
        <description>Write-only access to instruction memory location 28</description>
        <addressOffset>0xB8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM28</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM29</name>
        <description>Write-only access to instruction memory location 29</description>
        <addressOffset>0xBC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM29</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM3</name>
        <description>Write-only access to instruction memory location 3</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM30</name>
        <description>Write-only access to instruction memory location 30</description>
        <addressOffset>0xC0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM30</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM31</name>
        <description>Write-only access to instruction memory location 31</description>
        <addressOffset>0xC4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM31</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM4</name>
        <description>Write-only access to instruction memory location 4</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM5</name>
        <description>Write-only access to instruction memory location 5</description>
        <addressOffset>0x5C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM5</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM6</name>
        <description>Write-only access to instruction memory location 6</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM6</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM7</name>
        <description>Write-only access to instruction memory location 7</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM7</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM8</name>
        <description>Write-only access to instruction memory location 8</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM8</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INSTR_MEM9</name>
        <description>Write-only access to instruction memory location 9</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INSTR_MEM9</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0x128</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM0</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM0_RXNEMPTY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM0_TXNFULL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1_RXNEMPTY</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1_TXNFULL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2_RXNEMPTY</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2_TXNFULL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3_RXNEMPTY</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3_TXNFULL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ</name>
        <description>State machine IRQ flags register. Write 1 to clear. There are 8 state machine IRQ flags, which can be set, cleared, and waited on by the state machines. There&apos;s no fixed association between flags and state machines -- any state machine can use any flag.


 Any of the 8 flags can be used for timing synchronisation between state machines, using IRQ and WAIT instructions. The lower four of these flags are also routed out to system-level interrupt requests, alongside FIFO status interrupts -- see e.g. IRQ0_INTE.</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IRQ</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ0_INTE</name>
        <description>Interrupt Enable for irq0</description>
        <addressOffset>0x12C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM0</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM0_RXNEMPTY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM0_TXNFULL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1_RXNEMPTY</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1_TXNFULL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2_RXNEMPTY</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2_TXNFULL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3_RXNEMPTY</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3_TXNFULL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ0_INTF</name>
        <description>Interrupt Force for irq0</description>
        <addressOffset>0x130</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM0</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM0_RXNEMPTY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM0_TXNFULL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1_RXNEMPTY</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM1_TXNFULL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2_RXNEMPTY</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM2_TXNFULL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3_RXNEMPTY</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SM3_TXNFULL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ0_INTS</name>
        <description>Interrupt status after masking &amp; forcing for irq0</description>
        <addressOffset>0x134</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SM0</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM0_RXNEMPTY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM0_TXNFULL</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1_RXNEMPTY</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM1_TXNFULL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2_RXNEMPTY</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM2_TXNFULL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3_RXNEMPTY</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SM3_TXNFULL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
