JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 RX FIFO is disabled as a result (always reads as both full and empty).

 FIFOs are flushed when this bit is changed.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IN_SHIFTDIR</name>
            <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OUT_SHIFTDIR</name>
            <description>1 = shift out of output shift register to right. 0 = to left.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PULL_THRESH</name>
            <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place.

 Write 0 for value of 32.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PUSH_THRESH</name>
            <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place.

 Write 0 for value of 32.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TXF0</name>
        <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>TXF1</name>
        <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>TXF2</name>
        <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>TXF3</name>
        <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PLL_SYS</name>
      <groupName>PLL_SYS</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>CS</name>
        <description>Control and Status

 GENERAL CONSTRAINTS:

 Reference clock frequency min=5MHz, max=800MHz

 Feedback divider min=16, max=320

 VCO frequency min=750MHz, max=1600MHz</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BYPASS</name>
            <description>Passes the reference clock to the output instead of the divided VCO. The VCO continues to run so the user can switch between the reference clock and the divided VCO but the output will glitch when doing so.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LOCK</name>
            <description>PLL is locked</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REFDIV</name>
            <description>Divides the PLL input reference clock.

 Behaviour is undefined for div=0.

 PLL output will be unpredictable during refdiv changes, wait for lock=1 before using it.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FBDIV_INT</name>
        <description>Feedback divisor

 (note: this PLL does not support fractional division)</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FBDIV_INT</name>
            <description>see ctrl reg description for constraints</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PRIM</name>
        <description>Controls the PLL post dividers for the primary output

 (note: this PLL does not have a secondary output)

 the primary output is driven from VCO divided by postdiv1*postdiv2</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x77000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>POSTDIV1</name>
            <description>divide by 1-7</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POSTDIV2</name>
            <description>divide by 1-7</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PWR</name>
        <description>Controls the PLL power modes.</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2D</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DSMPD</name>
            <description>PLL DSM powerdown

 Nothing is achieved by setting this low.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PD</name>
            <description>PLL powerdown

