JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 To save power set high when PLL output not required.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POSTDIVPD</name>
            <description>PLL post divider powerdown

 To save power set high when PLL output not required or bypass=1.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VCOPD</name>
            <description>PLL VCO powerdown

 To save power set high when PLL output not required or bypass=1.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PLL_USB</name>
      <groupName>PLL_SYS</groupName>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>CS</name>
        <description>Control and Status

 GENERAL CONSTRAINTS:

 Reference clock frequency min=5MHz, max=800MHz

 Feedback divider min=16, max=320

 VCO frequency min=750MHz, max=1600MHz</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BYPASS</name>
            <description>Passes the reference clock to the output instead of the divided VCO. The VCO continues to run so the user can switch between the reference clock and the divided VCO but the output will glitch when doing so.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LOCK</name>
            <description>PLL is locked</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REFDIV</name>
            <description>Divides the PLL input reference clock.

 Behaviour is undefined for div=0.

 PLL output will be unpredictable during refdiv changes, wait for lock=1 before using it.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>FBDIV_INT</name>
        <description>Feedback divisor

 (note: this PLL does not support fractional division)</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FBDIV_INT</name>
            <description>see ctrl reg description for constraints</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PRIM</name>
        <description>Controls the PLL post dividers for the primary output

 (note: this PLL does not have a secondary output)

 the primary output is driven from VCO divided by postdiv1*postdiv2</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x77000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>POSTDIV1</name>
            <description>divide by 1-7</description>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POSTDIV2</name>
            <description>divide by 1-7</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PWR</name>
        <description>Controls the PLL power modes.</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2D</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DSMPD</name>
            <description>PLL DSM powerdown

 Nothing is achieved by setting this low.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PD</name>
            <description>PLL powerdown

 To save power set high when PLL output not required.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POSTDIVPD</name>
            <description>PLL post divider powerdown

 To save power set high when PLL output not required or bypass=1.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VCOPD</name>
            <description>PLL VCO powerdown

 To save power set high when PLL output not required or bypass=1.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PPB</name>
      <groupName>PPB</groupName>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>AIRCR</name>
        <description>Use the Application Interrupt and Reset Control Register to: determine data endianness, clear all active state information from debug halt mode, request a system reset.</description>
        <addressOffset>0xED0C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENDIANESS</name>
            <description>Data endianness implemented:

 0 = Little-endian.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SYSRESETREQ</name>
            <description>Writing 1 to this bit causes the SYSRESETREQ signal to the outer system to be asserted to request a reset. The intention is to force a large system reset of all major components except for debug. The C_HALT bit in the DHCSR is cleared as a result of the system reset requested. The debugger does not lose contact with the device.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VECTCLRACTIVE</name>
            <description>Clears all active state information for fixed and configurable exceptions. This bit: is self-clearing, can only be set by the DAP when the core is halted. When set: clears all active exception status of the processor, forces a return to Thread mode, forces an IPSR of 0. A debugger must re-initialize the stack.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VECTKEY</name>
            <description>Register key:

 Reads as Unknown

 On writes, write 0x05FA to VECTKEY, otherwise the write is ignored.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR</name>
        <description>The Configuration and Control Register permanently enables stack alignment and causes unaligned accesses to result in a Hard Fault.</description>
        <addressOffset>0xED14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>STKALIGN</name>
            <description>Always reads as one, indicates 8-byte stack alignment on exception entry. On exception entry, the processor uses bit[9] of the stacked PSR to indicate the stack alignment. On return from the exception it uses this stacked bit to restore the correct stack alignment.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>UNALIGN_TRP</name>
            <description>Always reads as one, indicates that all unaligned accesses generate a HardFault.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CPUID</name>
        <description>Read the CPU ID Base Register to determine: the ID number of the processor core, the version number of the processor core, the implementation details of the processor core.</description>
        <addressOffset>0xED00</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x410CC601</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ARCHITECTURE</name>
            <description>Constant that defines the architecture of the processor:

