JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 0xC = ARMv6-M architecture.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IMPLEMENTER</name>
            <description>Implementor code: 0x41 = ARM</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PARTNO</name>
            <description>Number of processor within family: 0xC60 = Cortex-M0+</description>
            <bitOffset>4</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REVISION</name>
            <description>Minor revision number m in the rnpm revision status:

 0x1 = Patch 1.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VARIANT</name>
            <description>Major revision number n in the rnpm revision status:

 0x0 = Revision 0.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ICSR</name>
        <description>Use the Interrupt Control State Register to set a pending Non-Maskable Interrupt (NMI), set or clear a pending PendSV, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, check the vector number of the active exception.</description>
        <addressOffset>0xED04</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ISRPENDING</name>
            <description>External interrupt pending flag</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ISRPREEMPT</name>
            <description>The system can only access this bit when the core is halted. It indicates that a pending interrupt is to be taken in the next running cycle. If C_MASKINTS is clear in the Debug Halting Control and Status Register, the interrupt is serviced.</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>NMIPENDSET</name>
            <description>Setting this bit will activate an NMI. Since NMI is the highest priority exception, it will activate as soon as it is registered.

 NMI set-pending bit.

 Write:

 0 = No effect.

 1 = Changes NMI exception state to pending.

 Read:

 0 = NMI exception is not pending.

 1 = NMI exception is pending.

 Because NMI is the highest-priority exception, normally the processor enters the NMI

 exception handler as soon as it detects a write of 1 to this bit. Entering the handler then clears

 this bit to 0. This means a read of this bit by the NMI exception handler returns 1 only if the

 NMI signal is reasserted while the processor is executing that handler.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PENDSTCLR</name>
            <description>SysTick exception clear-pending bit.

 Write:

 0 = No effect.

 1 = Removes the pending state from the SysTick exception.

 This bit is WO. On a register read its value is Unknown.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PENDSTSET</name>
            <description>SysTick exception set-pending bit.

 Write:

 0 = No effect.

 1 = Changes SysTick exception state to pending.

 Read:

 0 = SysTick exception is not pending.

 1 = SysTick exception is pending.</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PENDSVCLR</name>
            <description>PendSV clear-pending bit.

 Write:

 0 = No effect.

 1 = Removes the pending state from the PendSV exception.</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PENDSVSET</name>
            <description>PendSV set-pending bit.

 Write:

 0 = No effect.

 1 = Changes PendSV exception state to pending.

 Read:

 0 = PendSV exception is not pending.

 1 = PendSV exception is pending.

 Writing 1 to this bit is the only way to set the PendSV exception state to pending.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VECTACTIVE</name>
            <description>Active exception number field. Reset clears the VECTACTIVE field.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VECTPENDING</name>
            <description>Indicates the exception number for the highest priority pending exception: 0 = no pending exceptions. Non zero = The pending state includes the effect of memory-mapped enable and mask registers. It does not include the PRIMASK special-purpose register qualifier.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MPU_CTRL</name>
        <description>Use the MPU Control Register to enable and disable the MPU, and to control whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults and NMIs.</description>
        <addressOffset>0xED94</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENABLE</name>
            <description>Enables the MPU. If the MPU is disabled, privileged and unprivileged accesses use the default memory map.

 0 = MPU disabled.

 1 = MPU enabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HFNMIENA</name>
            <description>Controls the use of the MPU for HardFaults and NMIs. Setting this bit when ENABLE is clear results in UNPREDICTABLE behaviour.

 When the MPU is enabled:

 0 = MPU is disabled during HardFault and NMI handlers, regardless of the value of the ENABLE bit.

