JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 1 = the MPU is enabled during HardFault and NMI handlers.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PRIVDEFENA</name>
            <description>Controls whether the default memory map is enabled as a background region for privileged accesses. This bit is ignored when ENABLE is clear.

 0 = If the MPU is enabled, disables use of the default memory map. Any memory access to a location not

 covered by any enabled region causes a fault.

 1 = If the MPU is enabled, enables use of the default memory map as a background region for privileged software accesses.

 When enabled, the background region acts as if it is region number -1. Any region that is defined and enabled has priority over this default map.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MPU_RASR</name>
        <description>Use the MPU Region Attribute and Size Register to define the size, access behaviour and memory type of the region identified by MPU_RNR, and enable that region.</description>
        <addressOffset>0xEDA0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ATTRS</name>
            <description>The MPU Region Attribute field. Use to define the region attribute control.

 28 = XN: Instruction access disable bit:

 0 = Instruction fetches enabled.

 1 = Instruction fetches disabled.

 26:24 = AP: Access permission field

 18 = S: Shareable bit

 17 = C: Cacheable bit

 16 = B: Bufferable bit</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enables the region.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIZE</name>
            <description>Indicates the region size. Region size in bytes = 2^(SIZE+1). The minimum permitted value is 7 (b00111) = 256Bytes</description>
            <bitOffset>1</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRD</name>
            <description>Subregion Disable. For regions of 256 bytes or larger, each bit of this field controls whether one of the eight equal subregions is enabled.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MPU_RBAR</name>
        <description>Read the MPU Region Base Address Register to determine the base address of the region identified by MPU_RNR. Write to update the base address of said region or that of a specified region, with whose number MPU_RNR will also be updated.</description>
        <addressOffset>0xED9C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDR</name>
            <description>Base address of the region.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>REGION</name>
            <description>On writes, specifies the number of the region whose base address to update provided VALID is set written as 1. On reads, returns bits [3:0] of MPU_RNR.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VALID</name>
            <description>On writes, indicates whether the write must update the base address of the region identified by the REGION field, updating the MPU_RNR to indicate this new region.

 Write:

 0 = MPU_RNR not changed, and the processor:

 Updates the base address for the region specified in the MPU_RNR.

 Ignores the value of the REGION field.

 1 = The processor:

 Updates the value of the MPU_RNR to the value of the REGION field.

 Updates the base address for the region specified in the REGION field.

 Always reads as zero.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MPU_RNR</name>
        <description>Use the MPU Region Number Register to select the region currently accessed by MPU_RBAR and MPU_RASR.</description>
        <addressOffset>0xED98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>REGION</name>
            <description>Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers.

 The MPU supports 8 memory regions, so the permitted values of this field are 0-7.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MPU_TYPE</name>
        <description>Read the MPU Type Register to determine if the processor implements an MPU, and how many regions the MPU supports.</description>
        <addressOffset>0xED90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x800</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DREGION</name>
            <description>Number of regions supported by the MPU.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>IREGION</name>
            <description>Instruction region. Reads as zero as ARMv6-M only supports a unified MPU.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SEPARATE</name>
            <description>Indicates support for separate instruction and data address maps. Reads as 0 as ARMv6-M only supports a unified MPU.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_ICER</name>
        <description>Use the Interrupt Clear-Enable Registers to disable interrupts and determine which interrupts are currently enabled.</description>
        <addressOffset>0xE180</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLRENA</name>
            <description>Interrupt clear-enable bits.

 Write:

 0 = No effect.

