JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 1 = Disable interrupt.

 Read:

 0 = Interrupt disabled.

 1 = Interrupt enabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_ICPR</name>
        <description>Use the Interrupt Clear-Pending Register to clear pending interrupts and determine which interrupts are currently pending.</description>
        <addressOffset>0xE280</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLRPEND</name>
            <description>Interrupt clear-pending bits.

 Write:

 0 = No effect.

 1 = Removes pending state and interrupt.

 Read:

 0 = Interrupt is not pending.

 1 = Interrupt is pending.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR0</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.

 Note: Writing 1 to an NVIC_ICPR bit does not affect the active state of the corresponding interrupt.

 These registers are only word-accessible</description>
        <addressOffset>0xE400</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_0</name>
            <description>Priority of interrupt 0</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_1</name>
            <description>Priority of interrupt 1</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_2</name>
            <description>Priority of interrupt 2</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_3</name>
            <description>Priority of interrupt 3</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR1</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE404</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_4</name>
            <description>Priority of interrupt 4</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_5</name>
            <description>Priority of interrupt 5</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_6</name>
            <description>Priority of interrupt 6</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_7</name>
            <description>Priority of interrupt 7</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR2</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE408</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_10</name>
            <description>Priority of interrupt 10</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_11</name>
            <description>Priority of interrupt 11</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_8</name>
            <description>Priority of interrupt 8</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_9</name>
            <description>Priority of interrupt 9</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR3</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE40C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_12</name>
            <description>Priority of interrupt 12</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_13</name>
            <description>Priority of interrupt 13</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_14</name>
            <description>Priority of interrupt 14</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_15</name>
            <description>Priority of interrupt 15</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR4</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE410</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_16</name>
            <description>Priority of interrupt 16</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_17</name>
            <description>Priority of interrupt 17</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_18</name>
            <description>Priority of interrupt 18</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_19</name>
            <description>Priority of interrupt 19</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR5</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE414</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_20</name>
            <description>Priority of interrupt 20</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_21</name>
            <description>Priority of interrupt 21</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_22</name>
            <description>Priority of interrupt 22</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_23</name>
            <description>Priority of interrupt 23</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR6</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE418</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_24</name>
            <description>Priority of interrupt 24</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_25</name>
            <description>Priority of interrupt 25</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_26</name>
            <description>Priority of interrupt 26</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_27</name>
            <description>Priority of interrupt 27</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_IPR7</name>
        <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
        <addressOffset>0xE41C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IP_28</name>
            <description>Priority of interrupt 28</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_29</name>
            <description>Priority of interrupt 29</description>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_30</name>
            <description>Priority of interrupt 30</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>IP_31</name>
            <description>Priority of interrupt 31</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_ISER</name>
        <description>Use the Interrupt Set-Enable Register to enable interrupts and determine which interrupts are currently enabled.

