JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 If a pending interrupt is enabled, the NVIC activates the interrupt based on its priority. If an interrupt is not enabled, asserting its interrupt signal changes the interrupt state to pending, but the NVIC never activates the interrupt, regardless of its priority.</description>
        <addressOffset>0xE100</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SETENA</name>
            <description>Interrupt set-enable bits.

 Write:

 0 = No effect.

 1 = Enable interrupt.

 Read:

 0 = Interrupt disabled.

 1 = Interrupt enabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NVIC_ISPR</name>
        <description>The NVIC_ISPR forces interrupts into the pending state, and shows which interrupts are pending.</description>
        <addressOffset>0xE200</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SETPEND</name>
            <description>Interrupt set-pending bits.

 Write:

 0 = No effect.

 1 = Changes interrupt state to pending.

 Read:

 0 = Interrupt is not pending.

 1 = Interrupt is pending.

 Note: Writing 1 to the NVIC_ISPR bit corresponding to:

 An interrupt that is pending has no effect.

 A disabled interrupt sets the state of that interrupt to pending.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SCR</name>
        <description>System Control Register. Use the System Control Register for power-management functions: signal to the system when the processor can enter a low power state, control how the processor enters and exits low power states.</description>
        <addressOffset>0xED10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SEVONPEND</name>
            <description>Send Event on Pending bit:

 0 = Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded.

 1 = Enabled events and all interrupts, including disabled interrupts, can wakeup the processor.

 When an event or interrupt becomes pending, the event signal wakes up the processor from WFE. If the

 processor is not waiting for an event, the event is registered and affects the next WFE.

 The processor also wakes up on execution of an SEV instruction or an external event.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEEPDEEP</name>
            <description>Controls whether the processor uses sleep or deep sleep as its low power mode:

 0 = Sleep.

 1 = Deep sleep.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLEEPONEXIT</name>
            <description>Indicates sleep-on-exit when returning from Handler mode to Thread mode:

 0 = Do not sleep when returning to Thread mode.

 1 = Enter sleep, or deep sleep, on return from an ISR to Thread mode.

 Setting this bit to 1 enables an interrupt driven application to avoid returning to an empty main application.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SHCSR</name>
        <description>Use the System Handler Control and State Register to determine or clear the pending status of SVCall.</description>
        <addressOffset>0xED24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SVCALLPENDED</name>
            <description>Reads as 1 if SVCall is Pending. Write 1 to set pending SVCall, write 0 to clear pending SVCall.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SHPR2</name>
        <description>System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 2 to set the priority of SVCall.</description>
        <addressOffset>0xED1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PRI_11</name>
            <description>Priority of system handler 11, SVCall</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SHPR3</name>
        <description>System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 3 to set the priority of PendSV and SysTick.</description>
        <addressOffset>0xED20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PRI_14</name>
            <description>Priority of system handler 14, PendSV</description>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PRI_15</name>
            <description>Priority of system handler 15, SysTick</description>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SYST_CALIB</name>
        <description>Use the SysTick Calibration Value Register to enable software to scale to any required speed using divide and multiply.</description>
        <addressOffset>0xE01C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>NOREF</name>
            <description>If reads as 1, the Reference clock is not provided - the CLKSOURCE bit of the SysTick Control and Status register will be forced to 1 and cannot be cleared to 0.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SKEW</name>
            <description>If reads as 1, the calibration value for 10ms is inexact (due to clock frequency).</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TENMS</name>
            <description>An optional Reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If the value reads as 0, the calibration value is not known.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SYST_CSR</name>
        <description>Use the SysTick Control and Status Register to enable the SysTick features.</description>
        <addressOffset>0xE010</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLKSOURCE</name>
            <description>SysTick clock source. Always reads as one if SYST_CALIB reports NOREF.

 Selects the SysTick timer clock source:

 0 = External reference clock.

 1 = Processor clock.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>COUNTFLAG</name>
            <description>Returns 1 if timer counted to 0 since last time this was read. Clears on read by application or debugger.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enable SysTick counter:

 0 = Counter disabled.

 1 = Counter enabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TICKINT</name>
            <description>Enables SysTick exception request:

