JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>PH_CORRECT</name>
            <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PH_RET</name>
            <description>Retard the phase of the counter by 1 count, while it is running.

 Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4_CTR</name>
        <description>Direct access to the PWM counter</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CH4_CTR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4_DIV</name>
        <description>INT and FRAC form a fixed-point fractional number.

 Counting rate is system clock frequency divided by this number.

 Fractional division uses simple 1st-order sigma-delta.</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x10</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FRAC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CH4_TOP</name>
        <description>Counter wrap value</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xFFFF</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CH4_TOP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CH5_CC</name>
        <description>Counter compare values</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>A</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>B</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CH5_CSR</name>
        <description>Control and status register</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>A_INV</name>
            <description>Invert output A</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>B_INV</name>
            <description>Invert output B</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DIVMODE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>div</name>
                <description>Free-running counting at rate dictated by fractional divider</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>level</name>
                <description>Fractional divider operation is gated by the PWM B pin.</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>rise</name>
                <description>Counter advances with each rising edge of the PWM B pin.</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>fall</name>
                <description>Counter advances with each falling edge of the PWM B pin.</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>EN</name>
            <description>Enable the PWM channel.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PH_ADV</name>
            <description>Advance the phase of the counter by 1 count, while it is running.

 Self-clearing. Write a 1, and poll until low. Counter must be running

