JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ROSC</name>
      <groupName>ROSC</groupName>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>COUNT</name>
        <description>A down counter running at the ROSC frequency which counts to zero and stops.

 To start the counter write a non-zero value.

 Can be used for short software pauses when setting up time sensitive hardware.</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>COUNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL</name>
        <description>Ring Oscillator control</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xAA0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENABLE</name>
            <description>On power-up this field is initialised to ENABLE

 The system clock must be switched to another source before setting this field to DISABLE otherwise the chip will lock up

 The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>None</description>
                <value>3358</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>None</description>
                <value>4011</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>FREQ_RANGE</name>
            <description>Controls the number of delay stages in the ROSC ring

 LOW uses stages 0 to 7

 MEDIUM uses stages 0 to 5

 HIGH uses stages 0 to 3

 TOOHIGH uses stages 0 to 1 and should not be used because its frequency exceeds design specifications

 The clock output will not glitch when changing the range up one step at a time

 The clock output will glitch when changing the range down

 Note: the values here are gray coded which is why HIGH comes before TOOHIGH</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>LOW</name>
                <description>None</description>
                <value>4004</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>MEDIUM</name>
                <description>None</description>
                <value>4005</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>TOOHIGH</name>
                <description>None</description>
                <value>4006</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>HIGH</name>
                <description>None</description>
                <value>4007</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>DIV</name>
        <description>Controls the output divider</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DIV</name>
            <description>set to 0xaa0 + div where

 div = 0 divides by 32

 div = 1-31 divides by div

 any other value sets div=31

 this register resets to div=16</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>PASS</name>
                <description>None</description>
                <value>2720</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>DORMANT</name>
        <description>Ring Oscillator pause control

 This is used to save power by pausing the ROSC

 On power-up this field is initialised to WAKE

 An invalid write will also select WAKE

 Warning: setup the irq before selecting dormant mode</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>FREQA</name>
        <description>The FREQA &amp; FREQB registers control the frequency by controlling the drive strength of each stage

 The drive strength has 4 levels determined by the number of bits set

 Increasing the number of bits set increases the drive strength and increases the oscillation frequency

 0 bits set is the default drive strength

 1 bit set doubles the drive strength

 2 bits set triples drive strength

 3 bits set quadruples drive strength</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DS0</name>
            <description>Stage 0 drive strength</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS1</name>
            <description>Stage 1 drive strength</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS2</name>
            <description>Stage 2 drive strength</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS3</name>
            <description>Stage 3 drive strength</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PASSWD</name>
            <description>Set to 0x9696 to apply the settings

 Any other value in this field will set all drive strengths to 0</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>PASS</name>
                <description>None</description>
                <value>38550</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>FREQB</name>
        <description>For a detailed description see freqa register</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DS4</name>
            <description>Stage 4 drive strength</description>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS5</name>
            <description>Stage 5 drive strength</description>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS6</name>
            <description>Stage 6 drive strength</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DS7</name>
            <description>Stage 7 drive strength</description>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PASSWD</name>
            <description>Set to 0x9696 to apply the settings

 Any other value in this field will set all drive strengths to 0</description>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>PASS</name>
                <description>None</description>
                <value>38550</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>PHASE</name>
        <description>Controls the phase shifted output</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x8</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENABLE</name>
            <description>enable the phase-shifted output

