JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 this can be changed on-the-fly</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FLIP</name>
            <description>invert the phase-shifted output

 this is ignored when div=1</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PASSWD</name>
            <description>set to 0xaa

 any other value enables the output with shift=0</description>
            <bitOffset>4</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SHIFT</name>
            <description>phase shift the phase-shifted output by SHIFT input clocks

 this can be changed on-the-fly

 must be set to 0 before setting div=1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RANDOMBIT</name>
        <description>This just reads the state of the oscillator output so randomness is compromised if the ring oscillator is stopped or run at a harmonic of the bus frequency</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RANDOMBIT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STATUS</name>
        <description>Ring Oscillator Status</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BADWRITE</name>
            <description>An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE or FREQA or FREQB or DIV or PHASE or DORMANT</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>DIV_RUNNING</name>
            <description>post-divider is running

 this resets to 0 but transitions to 1 during chip startup</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ENABLED</name>
            <description>Oscillator is enabled but not necessarily running and stable

 this resets to 0 but transitions to 1 during chip startup</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STABLE</name>
            <description>Oscillator is running and stable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Register block to control RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4005C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>RTC_IRQ</name>
        <value>25</value>
      </interrupt>
      <registers>
      <register>
        <name>CLKDIV_M1</name>
        <description>Divider minus 1 for the 1 second counter. Safe to change the value when RTC is not enabled.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CLKDIV_M1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL</name>
        <description>RTC Control and status</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FORCE_NOTLEAPYEAR</name>
            <description>If set, leapyear is forced off.

 Useful for years divisible by 100 but not by 400</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LOAD</name>
            <description>Load RTC</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>RTC_ACTIVE</name>
            <description>RTC enabled (running)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RTC_ENABLE</name>
            <description>Enable RTC</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTE</name>
        <description>Interrupt Enable</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RTC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <description>Interrupt Force</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RTC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RTC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTS</name>
        <description>Interrupt status after masking &amp; forcing</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RTC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ_SETUP_0</name>
        <description>Interrupt setup register 0</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DAY</name>
            <description>Day of the month (1..31)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DAY_ENA</name>
            <description>Enable day matching</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MATCH_ACTIVE</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MATCH_ENA</name>
            <description>Global match enable. Don&apos;t change any other value while this one is enabled</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MONTH</name>
            <description>Month (1..12)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MONTH_ENA</name>
            <description>Enable month matching</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YEAR</name>
            <description>Year</description>
            <bitOffset>12</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YEAR_ENA</name>
            <description>Enable year matching</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IRQ_SETUP_1</name>
        <description>Interrupt setup register 1</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DOTW</name>
            <description>Day of the week</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOTW_ENA</name>
            <description>Enable day of the week matching</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOUR</name>
            <description>Hours</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOUR_ENA</name>
            <description>Enable hour matching</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MIN</name>
            <description>Minutes</description>
            <bitOffset>8</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MIN_ENA</name>
            <description>Enable minute matching</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SEC</name>
            <description>Seconds</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SEC_ENA</name>
            <description>Enable second matching</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RTC_0</name>
        <description>RTC register 0

 Read this before RTC 1!</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>DOTW</name>
            <description>Day of the week</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOUR</name>
            <description>Hours</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MIN</name>
            <description>Minutes</description>
            <bitOffset>8</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SEC</name>
            <description>Seconds</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RTC_1</name>
        <description>RTC register 1.</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>DAY</name>
            <description>Day of the month (1..31)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>MONTH</name>
            <description>Month (1..12)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>YEAR</name>
            <description>Year</description>
            <bitOffset>12</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SETUP_0</name>
        <description>RTC setup register 0</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DAY</name>
            <description>Day of the month (1..31)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MONTH</name>
            <description>Month (1..12)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>YEAR</name>
            <description>Year</description>
            <bitOffset>12</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SETUP_1</name>
        <description>RTC setup register 1</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DOTW</name>
            <description>Day of the week: 1-Monday...0-Sunday ISO 8601 mod 7</description>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOUR</name>
            <description>Hours</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MIN</name>
            <description>Minutes</description>
            <bitOffset>8</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SEC</name>
            <description>Seconds</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
