JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIO</name>
      <description>Single-cycle IO block

 Provides core-local and inter-core hardware for the two processors, with single-cycle access.</description>
      <groupName>SIO</groupName>
      <baseAddress>0xD0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>SIO_IRQ_PROC0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SIO_IRQ_PROC1</name>
        <value>16</value>
      </interrupt>
      <registers>
      <register>
        <name>CPUID</name>
        <description>Processor core identifier

 Value is 0 when read from processor core 0, and 1 when read from processor core 1.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_CSR</name>
        <description>Control and status register for divider.</description>
        <addressOffset>0x78</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DIRTY</name>
            <description>Changes to 1 when any register is written, and back to 0 when QUOTIENT is read.

 Software can use this flag to make save/restore more efficient (skip if not DIRTY).

 If the flag is used in this way, it&apos;s recommended to either read QUOTIENT only,

 or REMAINDER and then QUOTIENT, to prevent data loss on context switch.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>READY</name>
            <description>Reads as 0 when a calculation is in progress, 1 otherwise.

 Writing an operand (xDIVIDEND, xDIVISOR) will immediately start a new calculation, no

 matter if one is already in progress.

 Writing to a result register will immediately terminate any in-progress calculation

 and set the READY and DIRTY flags.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DIV_QUOTIENT</name>
        <description>Divider result quotient

 The result of `DIVIDEND / DIVISOR` (division). Contents undefined while CSR_READY is low.

 For signed calculations, QUOTIENT is negative when the signs of DIVIDEND and DIVISOR differ.

 This register can be written to directly, for context save/restore purposes. This halts any

 in-progress calculation and sets the CSR_READY and CSR_DIRTY flags.

 Reading from QUOTIENT clears the CSR_DIRTY flag, so should read results in the order

 REMAINDER, QUOTIENT if CSR_DIRTY is used.</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_REMAINDER</name>
        <description>Divider result remainder

 The result of `DIVIDEND % DIVISOR` (modulo). Contents undefined while CSR_READY is low.

 For signed calculations, REMAINDER is negative only when DIVIDEND is negative.

 This register can be written to directly, for context save/restore purposes. This halts any

 in-progress calculation and sets the CSR_READY and CSR_DIRTY flags.</description>
        <addressOffset>0x74</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_SDIVIDEND</name>
        <description>Divider signed dividend

 The same as UDIVIDEND, but starts a signed calculation, rather than unsigned.</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_SDIVISOR</name>
        <description>Divider signed divisor

 The same as UDIVISOR, but starts a signed calculation, rather than unsigned.</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_UDIVIDEND</name>
        <description>Divider unsigned dividend

 Write to the DIVIDEND operand of the divider, i.e. the p in `p / q`.

 Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER.

 UDIVIDEND/SDIVIDEND are aliases of the same internal register. The U alias starts an

 unsigned calculation, and the S alias starts a signed calculation.</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>DIV_UDIVISOR</name>
        <description>Divider unsigned divisor

 Write to the DIVISOR operand of the divider, i.e. the q in `p / q`.

 Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER.

 UDIVISOR/SDIVISOR are aliases of the same internal register. The U alias starts an

 unsigned calculation, and the S alias starts a signed calculation.</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>FIFO_RD</name>
        <description>Read access to this core&apos;s RX FIFO</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>FIFO_ST</name>
        <description>Status register for inter-core FIFOs (mailboxes).

 There is one FIFO in the core 0 -&gt; core 1 direction, and one core 1 -&gt; core 0. Both are 32 bits wide and 8 words deep.

