JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Core 0 can see the read side of the 1-&gt;0 FIFO (RX), and the write side of 0-&gt;1 FIFO (TX).

 Core 1 can see the read side of the 0-&gt;1 FIFO (RX), and the write side of 1-&gt;0 FIFO (TX).

 The SIO IRQ for each core is the logical OR of the VLD, WOF and ROE fields of its FIFO_ST register.</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RDY</name>
            <description>Value is 1 if this core&apos;s TX FIFO is not full (i.e. if FIFO_WR is ready for more data)</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ROE</name>
            <description>Sticky flag indicating the RX FIFO was read when empty. This read was ignored by the FIFO.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>VLD</name>
            <description>Value is 1 if this core&apos;s RX FIFO is not empty (i.e. if FIFO_RD is valid)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>WOF</name>
            <description>Sticky flag indicating the TX FIFO was written when full. This write was ignored by the FIFO.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>FIFO_WR</name>
        <description>Write access to this core&apos;s TX FIFO</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>GPIO_HI_IN</name>
        <description>Input value for QSPI pins</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_IN</name>
            <description>Input value on QSPI IO in order 0..5: SCLK, SSn, SD0, SD1, SD2, SD3</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OE</name>
        <description>QSPI output enable</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OE</name>
            <description>Set output enable (1/0 -&gt; output/input) for QSPI IO0...5.

 Reading back gives the last value written.

 If core 0 and core 1 both write to GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias),

 the result is as though the write from core 0 took place first,

 and the write from core 1 was then applied to that intermediate result.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OE_CLR</name>
        <description>QSPI output enable clear</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OE_CLR</name>
            <description>Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &amp;= ~wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OE_SET</name>
        <description>QSPI output enable set</description>
        <addressOffset>0x44</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OE_SET</name>
            <description>Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OE_XOR</name>
        <description>QSPI output enable XOR</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OE_XOR</name>
            <description>Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE ^= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OUT</name>
        <description>QSPI output value</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OUT</name>
            <description>Set output level (1/0 -&gt; high/low) for QSPI IO0...5.

 Reading back gives the last value written, NOT the input value from the pins.

 If core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or to a SET/CLR/XOR alias),

