JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 the result is as though the write from core 0 took place first,

 and the write from core 1 was then applied to that intermediate result.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OUT_CLR</name>
        <description>QSPI output value clear</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OUT_CLR</name>
            <description>Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT &amp;= ~wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OUT_SET</name>
        <description>QSPI output value set</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OUT_SET</name>
            <description>Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_HI_OUT_XOR</name>
        <description>QSPI output value XOR</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_HI_OUT_XOR</name>
            <description>Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT ^= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_IN</name>
        <description>Input value for GPIO pins</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_IN</name>
            <description>Input value for GPIO0...29</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OE</name>
        <description>GPIO output enable</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OE</name>
            <description>Set output enable (1/0 -&gt; output/input) for GPIO0...29.

 Reading back gives the last value written.

 If core 0 and core 1 both write to GPIO_OE simultaneously (or to a SET/CLR/XOR alias),

 the result is as though the write from core 0 took place first,

 and the write from core 1 was then applied to that intermediate result.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OE_CLR</name>
        <description>GPIO output enable clear</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OE_CLR</name>
            <description>Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &amp;= ~wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OE_SET</name>
        <description>GPIO output enable set</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OE_SET</name>
            <description>Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OE_XOR</name>
        <description>GPIO output enable XOR</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OE_XOR</name>
            <description>Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OUT</name>
        <description>GPIO output value</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OUT</name>
            <description>Set output level (1/0 -&gt; high/low) for GPIO0...29.

 Reading back gives the last value written, NOT the input value from the pins.

 If core 0 and core 1 both write to GPIO_OUT simultaneously (or to a SET/CLR/XOR alias),

