JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 the result is as though the write from core 0 took place first,

 and the write from core 1 was then applied to that intermediate result.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OUT_CLR</name>
        <description>GPIO output value clear</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OUT_CLR</name>
            <description>Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &amp;= ~wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OUT_SET</name>
        <description>GPIO output value set</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OUT_SET</name>
            <description>Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GPIO_OUT_XOR</name>
        <description>GPIO output value XOR</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>GPIO_OUT_XOR</name>
            <description>Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^= wdata`</description>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP0_ACCUM0</name>
        <description>Read/write access to accumulator 0</description>
        <addressOffset>0x80</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_ACCUM0_ADD</name>
        <description>Values written here are atomically added to ACCUM0

 Reading yields lane 0&apos;s raw shift and mask value (BASE0 not added).</description>
        <addressOffset>0xB4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTERP0_ACCUM0_ADD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP0_ACCUM1</name>
        <description>Read/write access to accumulator 1</description>
        <addressOffset>0x84</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_ACCUM1_ADD</name>
        <description>Values written here are atomically added to ACCUM1

 Reading yields lane 1&apos;s raw shift and mask value (BASE1 not added).</description>
        <addressOffset>0xB8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTERP0_ACCUM1_ADD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP0_BASE0</name>
        <description>Read/write access to BASE0 register.</description>
        <addressOffset>0x88</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_BASE1</name>
        <description>Read/write access to BASE1 register.</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_BASE2</name>
        <description>Read/write access to BASE2 register.</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_BASE_1AND0</name>
        <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously.

 Each half is sign-extended to 32 bits if that lane&apos;s SIGNED flag is set.</description>
        <addressOffset>0xBC</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_CTRL_LANE0</name>
        <description>Control register for lane 0</description>
        <addressOffset>0xAC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADD_RAW</name>
            <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BLEND</name>
            <description>Only present on INTERP0 on each core. If BLEND mode is enabled:

 - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled

 by the 8 LSBs of lane 1 shift and mask value (a fractional number between

 0 and 255/256ths)

 - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value)

 - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask)

 LANE1 SIGNED flag controls whether the interpolation is signed or unsigned.</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_INPUT</name>
            <description>If 1, feed the opposite lane&apos;s accumulator into this lane&apos;s shift + mask hardware.

 Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_RESULT</name>
            <description>If 1, feed the opposite lane&apos;s result into this lane&apos;s accumulator on POP.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FORCE_MSB</name>
            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.

 No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence

