JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 of pointers into flash or SRAM.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_LSB</name>
            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_MSB</name>
            <description>The most-significant bit allowed to pass by the mask (inclusive)

 Setting MSB &lt; LSB may cause chip to turn inside-out</description>
            <bitOffset>10</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OVERF</name>
            <description>Set if either OVERF0 or OVERF1 is set.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OVERF0</name>
            <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OVERF1</name>
            <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SHIFT</name>
            <description>Logical right-shift applied to accumulator before masking</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIGNED</name>
            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits

 before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP0_CTRL_LANE1</name>
        <description>Control register for lane 1</description>
        <addressOffset>0xB0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADD_RAW</name>
            <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_INPUT</name>
            <description>If 1, feed the opposite lane&apos;s accumulator into this lane&apos;s shift + mask hardware.

 Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_RESULT</name>
            <description>If 1, feed the opposite lane&apos;s result into this lane&apos;s accumulator on POP.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FORCE_MSB</name>
            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.

 No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence

 of pointers into flash or SRAM.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_LSB</name>
            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_MSB</name>
            <description>The most-significant bit allowed to pass by the mask (inclusive)

 Setting MSB &lt; LSB may cause chip to turn inside-out</description>
            <bitOffset>10</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SHIFT</name>
            <description>Logical right-shift applied to accumulator before masking</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIGNED</name>
            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits

 before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP0_PEEK_FULL</name>
        <description>Read FULL result, without altering any internal state (PEEK).</description>
        <addressOffset>0xA8</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_PEEK_LANE0</name>
        <description>Read LANE0 result, without altering any internal state (PEEK).</description>
        <addressOffset>0xA0</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_PEEK_LANE1</name>
        <description>Read LANE1 result, without altering any internal state (PEEK).</description>
        <addressOffset>0xA4</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_POP_FULL</name>
        <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
        <addressOffset>0x9C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_POP_LANE0</name>
        <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP0_POP_LANE1</name>
        <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_ACCUM0</name>
        <description>Read/write access to accumulator 0</description>
        <addressOffset>0xC0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_ACCUM0_ADD</name>
        <description>Values written here are atomically added to ACCUM0

