JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 Reading yields lane 0&apos;s raw shift and mask value (BASE0 not added).</description>
        <addressOffset>0xF4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTERP1_ACCUM0_ADD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP1_ACCUM1</name>
        <description>Read/write access to accumulator 1</description>
        <addressOffset>0xC4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_ACCUM1_ADD</name>
        <description>Values written here are atomically added to ACCUM1

 Reading yields lane 1&apos;s raw shift and mask value (BASE1 not added).</description>
        <addressOffset>0xF8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INTERP1_ACCUM1_ADD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTERP1_BASE0</name>
        <description>Read/write access to BASE0 register.</description>
        <addressOffset>0xC8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_BASE1</name>
        <description>Read/write access to BASE1 register.</description>
        <addressOffset>0xCC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_BASE2</name>
        <description>Read/write access to BASE2 register.</description>
        <addressOffset>0xD0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_BASE_1AND0</name>
        <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously.

 Each half is sign-extended to 32 bits if that lane&apos;s SIGNED flag is set.</description>
        <addressOffset>0xFC</addressOffset>
        <size>32</size>
        <access>write-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>INTERP1_CTRL_LANE0</name>
        <description>Control register for lane 0</description>
        <addressOffset>0xEC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADD_RAW</name>
            <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CLAMP</name>
            <description>Only present on INTERP1 on each core. If CLAMP mode is enabled:

 - LANE0 result is shifted and masked ACCUM0, clamped by a lower bound of

 BASE0 and an upper bound of BASE1.

 - Signedness of these comparisons is determined by LANE0_CTRL_SIGNED</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_INPUT</name>
            <description>If 1, feed the opposite lane&apos;s accumulator into this lane&apos;s shift + mask hardware.

 Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>CROSS_RESULT</name>
            <description>If 1, feed the opposite lane&apos;s result into this lane&apos;s accumulator on POP.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FORCE_MSB</name>
            <description>ORed into bits 29:28 of the lane result presented to the processor on the bus.

 No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence

 of pointers into flash or SRAM.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_LSB</name>
            <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
            <bitOffset>5</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MASK_MSB</name>
            <description>The most-significant bit allowed to pass by the mask (inclusive)

 Setting MSB &lt; LSB may cause chip to turn inside-out</description>
            <bitOffset>10</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OVERF</name>
            <description>Set if either OVERF0 or OVERF1 is set.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OVERF0</name>
            <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>OVERF1</name>
            <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SHIFT</name>
            <description>Logical right-shift applied to accumulator before masking</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIGNED</name>
            <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits

