JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x100</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK1</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x104</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK10</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x128</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK11</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x12C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK12</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x130</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK13</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x134</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK14</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x138</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK15</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x13C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK16</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x140</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK17</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x144</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK18</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

