JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x148</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK19</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x14C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK2</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x108</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK20</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x150</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK21</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x154</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK22</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x158</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK23</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x15C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK24</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x160</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK25</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x164</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK26</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x168</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK27</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

