JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x16C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK28</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x170</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK29</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x174</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK3</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x10C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK30</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x178</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK31</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x17C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK4</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x110</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK5</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x114</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK6</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x118</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK7</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

 The value returned on success is 0x1 &lt;&lt; lock number.</description>
        <addressOffset>0x11C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SPINLOCK8</name>
        <description>Reading from a spinlock address will:

 - Return 0 if lock is already locked

 - Otherwise return nonzero, and simultaneously claim the lock


 Writing (any value) releases the lock.

 If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins.

