JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <groupName>SPI0</groupName>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>SPI1_IRQ</name>
        <value>19</value>
      </interrupt>
      <registers>
      <register>
        <name>SSPCPSR</name>
        <description>Clock prescale register, SSPCPSR on page 3-8</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CPSDVSR</name>
            <description>Clock prescale divisor. Must be an even number from 2-254, depending on the frequency of SSPCLK. The least significant bit always returns zero on reads.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPCR0</name>
        <description>Control register 0, SSPCR0 on page 3-4</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DSS</name>
            <description>Data Size Select: 0000 Reserved, undefined operation. 0001 Reserved, undefined operation. 0010 Reserved, undefined operation. 0011 4-bit data. 0100 5-bit data. 0101 6-bit data. 0110 7-bit data. 0111 8-bit data. 1000 9-bit data. 1001 10-bit data. 1010 11-bit data. 1011 12-bit data. 1100 13-bit data. 1101 14-bit data. 1110 15-bit data. 1111 16-bit data.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FRF</name>
            <description>Frame format: 00 Motorola SPI frame format. 01 TI synchronous serial frame format. 10 National Microwire frame format. 11 Reserved, undefined operation.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCR</name>
            <description>Serial clock rate. The value SCR is used to generate the transmit and receive bit rate of the PrimeCell SSP. The bit rate is: F SSPCLK CPSDVSR x (1+SCR) where CPSDVSR is an even value from 2-254, programmed through the SSPCPSR register and SCR is a value from 0-255.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPH</name>
            <description>SSPCLKOUT phase, applicable to Motorola SPI frame format only. See Motorola SPI frame format on page 2-10.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPO</name>
            <description>SSPCLKOUT polarity, applicable to Motorola SPI frame format only. See Motorola SPI frame format on page 2-10.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPCR1</name>
        <description>Control register 1, SSPCR1 on page 3-5</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>LBM</name>
            <description>Loop back mode: 0 Normal serial port operation enabled. 1 Output of transmit serial shifter is connected to input of receive serial shifter internally.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MS</name>
            <description>Master or slave mode select. This bit can be modified only when the PrimeCell SSP is disabled, SSE=0: 0 Device configured as master, default. 1 Device configured as slave.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SOD</name>
            <description>Slave-mode output disable. This bit is relevant only in the slave mode, MS=1. In multiple-slave systems, it is possible for an PrimeCell SSP master to broadcast a message to all slaves in the system while ensuring that only one slave drives data onto its serial output line. In such systems the RXD lines from multiple slaves could be tied together. To operate in such systems, the SOD bit can be set if the PrimeCell SSP slave is not supposed to drive the SSPTXD line: 0 SSP can drive the SSPTXD output in slave mode. 1 SSP must not drive the SSPTXD output in slave mode.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SSE</name>
            <description>Synchronous serial port enable: 0 SSP operation disabled. 1 SSP operation enabled.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPDMACR</name>
        <description>DMA control register, SSPDMACR on page 3-12</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXDMAE</name>
            <description>Receive DMA Enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXDMAE</name>
            <description>Transmit DMA Enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPDR</name>
        <description>Data register, SSPDR on page 3-6</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DATA</name>
            <description>Transmit/Receive FIFO: Read Receive FIFO. Write Transmit FIFO. You must right-justify data when the PrimeCell SSP is programmed for a data size that is less than 16 bits. Unused bits at the top are ignored by transmit logic. The receive logic automatically right-justifies.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPICR</name>
        <description>Interrupt clear register, SSPICR on page 3-11</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RORIC</name>
            <description>Clears the SSPRORINTR interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>RTIC</name>
            <description>Clears the SSPRTINTR interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPIMSC</name>
        <description>Interrupt mask set or clear register, SSPIMSC on page 3-9</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RORIM</name>
            <description>Receive overrun interrupt mask: 0 Receive FIFO written to while full condition interrupt is masked. 1 Receive FIFO written to while full condition interrupt is not masked.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RTIM</name>
            <description>Receive timeout interrupt mask: 0 Receive FIFO not empty and no read prior to timeout period interrupt is masked. 1 Receive FIFO not empty and no read prior to timeout period interrupt is not masked.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXIM</name>
            <description>Receive FIFO interrupt mask: 0 Receive FIFO half full or less condition interrupt is masked. 1 Receive FIFO half full or less condition interrupt is not masked.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXIM</name>
            <description>Transmit FIFO interrupt mask: 0 Transmit FIFO half empty or less condition interrupt is masked. 1 Transmit FIFO half empty or less condition interrupt is not masked.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPMIS</name>
        <description>Masked interrupt status register, SSPMIS on page 3-11</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RORMIS</name>
            <description>Gives the receive over run masked interrupt status, after masking, of the SSPRORINTR interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RTMIS</name>
            <description>Gives the receive timeout masked interrupt state, after masking, of the SSPRTINTR interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXMIS</name>
            <description>Gives the receive FIFO masked interrupt state, after masking, of the SSPRXINTR interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXMIS</name>
            <description>Gives the transmit FIFO masked interrupt state, after masking, of the SSPTXINTR interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPCELLID0</name>
        <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
        <addressOffset>0xFF0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xD</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSPPCELLID0</name>
            <description>These bits read back as 0x0D</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPCELLID1</name>
        <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
        <addressOffset>0xFF4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xF0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSPPCELLID1</name>
            <description>These bits read back as 0xF0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPCELLID2</name>
        <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
        <addressOffset>0xFF8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x5</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSPPCELLID2</name>
            <description>These bits read back as 0x05</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPCELLID3</name>
        <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
        <addressOffset>0xFFC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xB1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSPPCELLID3</name>
            <description>These bits read back as 0xB1</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPERIPHID0</name>
        <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
        <addressOffset>0xFE0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x22</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PARTNUMBER0</name>
            <description>These bits read back as 0x22</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPERIPHID1</name>
        <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
        <addressOffset>0xFE4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x10</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DESIGNER0</name>
            <description>These bits read back as 0x1</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PARTNUMBER1</name>
            <description>These bits read back as 0x0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPERIPHID2</name>
        <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
        <addressOffset>0xFE8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x34</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DESIGNER1</name>
            <description>These bits read back as 0x4</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REVISION</name>
            <description>These bits return the peripheral revision</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPPERIPHID3</name>
        <description>Peripheral identification registers, SSPPeriphID0-3 on page 3-13</description>
        <addressOffset>0xFEC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CONFIGURATION</name>
            <description>These bits read back as 0x00</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPRIS</name>
        <description>Raw interrupt status register, SSPRIS on page 3-10</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x8</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RORRIS</name>
            <description>Gives the raw interrupt state, prior to masking, of the SSPRORINTR interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RTRIS</name>
            <description>Gives the raw interrupt state, prior to masking, of the SSPRTINTR interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXRIS</name>
            <description>Gives the raw interrupt state, prior to masking, of the SSPRXINTR interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXRIS</name>
            <description>Gives the raw interrupt state, prior to masking, of the SSPTXINTR interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSPSR</name>
        <description>Status register, SSPSR on page 3-7</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x3</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BSY</name>
            <description>PrimeCell SSP busy flag, RO: 0 SSP is idle. 1 SSP is currently transmitting and/or receiving a frame or the transmit FIFO is not empty.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFF</name>
            <description>Receive FIFO full, RO: 0 Receive FIFO is not full. 1 Receive FIFO is full.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RNE</name>
            <description>Receive FIFO not empty, RO: 0 Receive FIFO is empty. 1 Receive FIFO is not empty.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TFE</name>
            <description>Transmit FIFO empty, RO: 0 Transmit FIFO is not empty. 1 Transmit FIFO is empty.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TNF</name>
            <description>Transmit FIFO not full, RO: 0 Transmit FIFO is full. 1 Transmit FIFO is not full.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
