JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>Register block for various chip control signals</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>DBGFORCE</name>
        <description>Directly control the SWD debug port of either processor</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x66</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PROC0_ATTACH</name>
            <description>Attach processor 0 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC0_SWCLK</name>
            <description>Directly drive processor 0 SWCLK, if PROC0_ATTACH is set</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC0_SWDI</name>
            <description>Directly drive processor 0 SWDIO input, if PROC0_ATTACH is set</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC0_SWDO</name>
            <description>Observe the value of processor 0 SWDIO output.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PROC1_ATTACH</name>
            <description>Attach processor 1 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC1_SWCLK</name>
            <description>Directly drive processor 1 SWCLK, if PROC1_ATTACH is set</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC1_SWDI</name>
            <description>Directly drive processor 1 SWDIO input, if PROC1_ATTACH is set</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC1_SWDO</name>
            <description>Observe the value of processor 1 SWDIO output.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MEMPOWERDOWN</name>
        <description>Control power downs to memories. Set high to power down memories.

 Use with extreme caution</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ROM</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SRAM5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>USB</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PROC0_NMI_MASK</name>
        <description>Processor core 0 NMI source mask

 Set a bit high to enable NMI from that IRQ</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>PROC1_NMI_MASK</name>
        <description>Processor core 1 NMI source mask

 Set a bit high to enable NMI from that IRQ</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>PROC_CONFIG</name>
        <description>Configuration for processors</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x10000000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PROC0_DAP_INSTID</name>
            <description>Configure proc0 DAP instance ID.

 Recommend that this is NOT changed until you require debug access in multi-chip environment

 WARNING: do not set to 15 as this is reserved for RescueDP</description>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC0_HALTED</name>
            <description>Indication that proc0 has halted</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PROC1_DAP_INSTID</name>
            <description>Configure proc1 DAP instance ID.

 Recommend that this is NOT changed until you require debug access in multi-chip environment

 WARNING: do not set to 15 as this is reserved for RescueDP</description>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PROC1_HALTED</name>
            <description>Indication that proc1 has halted</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PROC_IN_SYNC_BYPASS</name>
        <description>For each bit, if 1, bypass the input synchronizer between that GPIO

 and the GPIO input register in the SIO. The input synchronizers should

 generally be unbypassed, to avoid injecting metastabilities into processors.

 If you&apos;re feeling brave, you can bypass to save two cycles of input

 latency. This register applies to GPIO 0...29.</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PROC_IN_SYNC_BYPASS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>PROC_IN_SYNC_BYPASS_HI</name>
        <description>For each bit, if 1, bypass the input synchronizer between that GPIO

 and the GPIO input register in the SIO. The input synchronizers should

 generally be unbypassed, to avoid injecting metastabilities into processors.

 If you&apos;re feeling brave, you can bypass to save two cycles of input

 latency. This register applies to GPIO 30...35 (the QSPI IOs).</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>PROC_IN_SYNC_BYPASS_HI</name>
            <bitOffset>0</bitOffset>
            <bitWidth>6</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
