JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSINFO</name>
      <groupName>SYSINFO</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>CHIP_ID</name>
        <description>JEDEC JEP-106 compliant chip identifier.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MANUFACTURER</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PART</name>
            <bitOffset>12</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REVISION</name>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>GITREF_RP2040</name>
        <description>Git hash of the chip source. Used to identify chip version.</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>PLATFORM</name>
        <description>Platform register. Allows software to know what environment it is running in.</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ASIC</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FPGA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TBMAN</name>
      <description>Testbench manager. Allows the programmer to know what platform their software is running on.</description>
      <groupName>TBMAN</groupName>
      <baseAddress>0x4006C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>PLATFORM</name>
        <description>Indicates the type of platform in use</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x5</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ASIC</name>
            <description>Indicates the platform is an ASIC</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FPGA</name>
            <description>Indicates the platform is an FPGA</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER</name>
      <description>Controls time and alarms

 time is a 64 bit value indicating the time in usec since power-on

 timeh is the top 32 bits of time &amp; timel is the bottom 32 bits

 to change time write to timelw before timehw

 to read time read from timelr before timehr

 An alarm is set by setting alarm_enable and writing to the corresponding alarm register

 When an alarm is pending, the corresponding alarm_running signal will be high

 An alarm can be cancelled before it has finished by clearing the alarm_enable

 When an alarm fires, the corresponding alarm_irq is set and alarm_running is cleared

 To clear the interrupt write a 1 to the corresponding alarm_irq</description>
      <groupName>TIMER</groupName>
      <baseAddress>0x40054000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>TIMER_IRQ_0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_3</name>
        <value>3</value>
      </interrupt>
      <registers>
      <register>
        <name>ALARM0</name>
        <description>Arm alarm 0, and configure the time it will fire.

 Once armed, the alarm fires when TIMER_ALARM0 == TIMELR.

 The alarm will disarm itself once it fires, and can

 be disarmed early using the ARMED status register.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>ALARM1</name>
        <description>Arm alarm 1, and configure the time it will fire.

 Once armed, the alarm fires when TIMER_ALARM1 == TIMELR.

 The alarm will disarm itself once it fires, and can

 be disarmed early using the ARMED status register.</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>ALARM2</name>
        <description>Arm alarm 2, and configure the time it will fire.

 Once armed, the alarm fires when TIMER_ALARM2 == TIMELR.

 The alarm will disarm itself once it fires, and can

 be disarmed early using the ARMED status register.</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>ALARM3</name>
        <description>Arm alarm 3, and configure the time it will fire.

 Once armed, the alarm fires when TIMER_ALARM3 == TIMELR.

 The alarm will disarm itself once it fires, and can

 be disarmed early using the ARMED status register.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>ARMED</name>
        <description>Indicates the armed/disarmed status of each alarm.

