JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>EP13_IN_CONTROL</name>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>BUFFER_ADDRESS</name>
            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFERED</name>
            <description>This endpoint is double buffered.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT_TYPE</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>Control</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Isochronous</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Bulk</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Interrupt</name>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INTERRUPT_ON_NAK</name>
            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_ON_STALL</name>
            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_BUFF</name>
            <description>Trigger an interrupt each time a buffer is done.</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP13_OUT_BUFFER_CONTROL</name>
        <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1.

 Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
        <addressOffset>0xEC</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>AVAILABLE_0</name>
            <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AVAILABLE_1</name>
            <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFER_ISO_OFFSET</name>
            <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint.

 For a non Isochronous endpoint the offset is always 64 bytes.</description>
            <bitOffset>27</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>128</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>256</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>512</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1024</name>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>FULL_0</name>
            <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FULL_1</name>
            <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LAST_0</name>
            <description>Buffer 0 is the last buffer of the transfer.</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LAST_1</name>
            <description>Buffer 1 is the last buffer of the transfer.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LENGTH_0</name>
            <description>The length of the data in buffer 0.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LENGTH_1</name>
            <description>The length of the data in buffer 1.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PID_0</name>
            <description>The data pid of buffer 0.</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PID_1</name>
            <description>The data pid of buffer 1.</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RESET</name>
            <description>Reset the buffer selector to buffer 0.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Reply with a stall (valid for both buffers).</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP13_OUT_CONTROL</name>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>BUFFER_ADDRESS</name>
            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFERED</name>
            <description>This endpoint is double buffered.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT_TYPE</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>Control</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Isochronous</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Bulk</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Interrupt</name>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INTERRUPT_ON_NAK</name>
            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_ON_STALL</name>
            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_BUFF</name>
            <description>Trigger an interrupt each time a buffer is done.</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP14_IN_BUFFER_CONTROL</name>
        <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1.

 Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
        <addressOffset>0xF0</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>AVAILABLE_0</name>
            <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AVAILABLE_1</name>
            <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFER_ISO_OFFSET</name>
            <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint.

 For a non Isochronous endpoint the offset is always 64 bytes.</description>
            <bitOffset>27</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>128</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>256</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>512</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1024</name>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>FULL_0</name>
            <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FULL_1</name>
            <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LAST_0</name>
            <description>Buffer 0 is the last buffer of the transfer.</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LAST_1</name>
            <description>Buffer 1 is the last buffer of the transfer.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LENGTH_0</name>
            <description>The length of the data in buffer 0.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>LENGTH_1</name>
            <description>The length of the data in buffer 1.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PID_0</name>
            <description>The data pid of buffer 0.</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PID_1</name>
            <description>The data pid of buffer 1.</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RESET</name>
            <description>Reset the buffer selector to buffer 0.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Reply with a stall (valid for both buffers).</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP14_IN_CONTROL</name>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>BUFFER_ADDRESS</name>
            <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFERED</name>
            <description>This endpoint is double buffered.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT_TYPE</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>Control</name>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Isochronous</name>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Bulk</name>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>Interrupt</name>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>INTERRUPT_ON_NAK</name>
            <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_ON_STALL</name>
            <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_BUFF</name>
            <description>Trigger an interrupt each time a buffer is done.</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTERRUPT_PER_DOUBLE_BUFF</name>
            <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP14_OUT_BUFFER_CONTROL</name>
        <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1.

 Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
        <addressOffset>0xF4</addressOffset>
        <size>32</size>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <fields>
          <field>
            <name>AVAILABLE_0</name>
            <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>AVAILABLE_1</name>
            <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DOUBLE_BUFFER_ISO_OFFSET</name>
            <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint.

