JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBCTRL_REGS</name>
      <description>USB FS/LS controller device registers</description>
      <groupName>USBCTRL_REGS</groupName>
      <baseAddress>0x50110000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>USBCTRL_IRQ</name>
        <value>5</value>
      </interrupt>
      <registers>
      <register>
        <name>ADDR_ENDP</name>
        <description>Device address and endpoint control</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Device endpoint to send data to. Only valid for HOST mode.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP1</name>
        <description>Interrupt endpoint 1. Only valid for HOST mode.</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP10</name>
        <description>Interrupt endpoint 10. Only valid for HOST mode.</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP11</name>
        <description>Interrupt endpoint 11. Only valid for HOST mode.</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP12</name>
        <description>Interrupt endpoint 12. Only valid for HOST mode.</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP13</name>
        <description>Interrupt endpoint 13. Only valid for HOST mode.</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP14</name>
        <description>Interrupt endpoint 14. Only valid for HOST mode.</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP15</name>
        <description>Interrupt endpoint 15. Only valid for HOST mode.</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP2</name>
        <description>Interrupt endpoint 2. Only valid for HOST mode.</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP3</name>
        <description>Interrupt endpoint 3. Only valid for HOST mode.</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP4</name>
        <description>Interrupt endpoint 4. Only valid for HOST mode.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP5</name>
        <description>Interrupt endpoint 5. Only valid for HOST mode.</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP6</name>
        <description>Interrupt endpoint 6. Only valid for HOST mode.</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP7</name>
        <description>Interrupt endpoint 7. Only valid for HOST mode.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP8</name>
        <description>Interrupt endpoint 8. Only valid for HOST mode.</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ADDR_ENDP9</name>
        <description>Interrupt endpoint 9. Only valid for HOST mode.</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDRESS</name>
            <description>Device address</description>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENDPOINT</name>
            <description>Endpoint number of the interrupt endpoint</description>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_DIR</name>
            <description>Direction of the interrupt endpoint. In=0, Out=1</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INTEP_PREAMBLE</name>
            <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
