JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>EP_ABORT_DONE</name>
        <description>Device only: Used in conjunction with `EP_ABORT`. Set once an endpoint is idle so the programmer knows it is safe to modify the buffer control register.</description>
        <addressOffset>0x64</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EP0_IN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP0_OUT</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP10_IN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP10_OUT</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP11_IN</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP11_OUT</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP12_IN</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP12_OUT</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP13_IN</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP13_OUT</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP14_IN</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP14_OUT</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP15_IN</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP15_OUT</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP1_IN</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP1_OUT</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP2_IN</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP2_OUT</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP3_IN</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP3_OUT</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP4_IN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP4_OUT</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP5_IN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP5_OUT</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP6_IN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP6_OUT</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP7_IN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP7_OUT</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP8_IN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP8_OUT</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP9_IN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP9_OUT</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>EP_STALL_ARM</name>
        <description>Device: this bit must be set in conjunction with the `STALL` bit in the buffer control register to send a STALL on EP0. The device controller clears these bits when a SETUP packet is received because the USB spec requires that a STALL condition is cleared when a SETUP packet is received.</description>
        <addressOffset>0x68</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EP0_IN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_OUT</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>EP_STATUS_STALL_NAK</name>
        <description>Device: bits are set when the `IRQ_ON_NAK` or `IRQ_ON_STALL` bits are set. For EP0 this comes from `SIE_CTRL`. For all other endpoints it comes from the endpoint control register.</description>
        <addressOffset>0x70</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EP0_IN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP0_OUT</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP10_IN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP10_OUT</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP11_IN</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP11_OUT</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP12_IN</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP12_OUT</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP13_IN</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP13_OUT</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP14_IN</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP14_OUT</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP15_IN</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP15_OUT</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP1_IN</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP1_OUT</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP2_IN</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP2_OUT</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP3_IN</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP3_OUT</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP4_IN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP4_OUT</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP5_IN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP5_OUT</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP6_IN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP6_OUT</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP7_IN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP7_OUT</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP8_IN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP8_OUT</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP9_IN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>EP9_OUT</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
