JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>INTE</name>
        <description>Interrupt Enable</description>
        <addressOffset>0x90</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ABORT_DONE</name>
            <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUFF_STATUS</name>
            <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUS_RESET</name>
            <description>Source: SIE_STATUS.BUS_RESET</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_CONN_DIS</name>
            <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_RESUME_FROM_HOST</name>
            <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_SOF</name>
            <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_SUSPEND</name>
            <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP_STALL_NAK</name>
            <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_BIT_STUFF</name>
            <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_CRC</name>
            <description>Source: SIE_STATUS.CRC_ERROR</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_DATA_SEQ</name>
            <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_RX_OVERFLOW</name>
            <description>Source: SIE_STATUS.RX_OVERFLOW</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_RX_TIMEOUT</name>
            <description>Source: SIE_STATUS.RX_TIMEOUT</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_CONN_DIS</name>
            <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_RESUME</name>
            <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_SOF</name>
            <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SETUP_REQ</name>
            <description>Device. Source: SIE_STATUS.SETUP_REC</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Source: SIE_STATUS.STALL_REC</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRANS_COMPLETE</name>
            <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VBUS_DETECT</name>
            <description>Source: SIE_STATUS.VBUS_DETECTED</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <description>Interrupt Force</description>
        <addressOffset>0x94</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ABORT_DONE</name>
            <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUFF_STATUS</name>
            <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>BUS_RESET</name>
            <description>Source: SIE_STATUS.BUS_RESET</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_CONN_DIS</name>
            <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_RESUME_FROM_HOST</name>
            <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_SOF</name>
            <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DEV_SUSPEND</name>
            <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP_STALL_NAK</name>
            <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_BIT_STUFF</name>
            <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_CRC</name>
            <description>Source: SIE_STATUS.CRC_ERROR</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_DATA_SEQ</name>
            <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_RX_OVERFLOW</name>
            <description>Source: SIE_STATUS.RX_OVERFLOW</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERROR_RX_TIMEOUT</name>
            <description>Source: SIE_STATUS.RX_TIMEOUT</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_CONN_DIS</name>
            <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_RESUME</name>
            <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_SOF</name>
            <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SETUP_REQ</name>
            <description>Device. Source: SIE_STATUS.SETUP_REC</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Source: SIE_STATUS.STALL_REC</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRANS_COMPLETE</name>
            <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VBUS_DETECT</name>
            <description>Source: SIE_STATUS.VBUS_DETECTED</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INTR</name>
        <description>Raw Interrupts</description>
        <addressOffset>0x8C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ABORT_DONE</name>
            <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BUFF_STATUS</name>
            <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BUS_RESET</name>
            <description>Source: SIE_STATUS.BUS_RESET</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_CONN_DIS</name>
            <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_RESUME_FROM_HOST</name>
            <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_SOF</name>
            <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_SUSPEND</name>
            <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EP_STALL_NAK</name>
            <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_BIT_STUFF</name>
            <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_CRC</name>
            <description>Source: SIE_STATUS.CRC_ERROR</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_DATA_SEQ</name>
            <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_RX_OVERFLOW</name>
            <description>Source: SIE_STATUS.RX_OVERFLOW</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_RX_TIMEOUT</name>
            <description>Source: SIE_STATUS.RX_TIMEOUT</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_CONN_DIS</name>
            <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_RESUME</name>
            <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_SOF</name>
            <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SETUP_REQ</name>
            <description>Device. Source: SIE_STATUS.SETUP_REC</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Source: SIE_STATUS.STALL_REC</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TRANS_COMPLETE</name>
            <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VBUS_DETECT</name>
            <description>Source: SIE_STATUS.VBUS_DETECTED</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
