JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>INTS</name>
        <description>Interrupt status after masking &amp; forcing</description>
        <addressOffset>0x98</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ABORT_DONE</name>
            <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BUFF_STATUS</name>
            <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BUS_RESET</name>
            <description>Source: SIE_STATUS.BUS_RESET</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_CONN_DIS</name>
            <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_RESUME_FROM_HOST</name>
            <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_SOF</name>
            <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DEV_SUSPEND</name>
            <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>EP_STALL_NAK</name>
            <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_BIT_STUFF</name>
            <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_CRC</name>
            <description>Source: SIE_STATUS.CRC_ERROR</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_DATA_SEQ</name>
            <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_RX_OVERFLOW</name>
            <description>Source: SIE_STATUS.RX_OVERFLOW</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ERROR_RX_TIMEOUT</name>
            <description>Source: SIE_STATUS.RX_TIMEOUT</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_CONN_DIS</name>
            <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_RESUME</name>
            <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HOST_SOF</name>
            <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>SETUP_REQ</name>
            <description>Device. Source: SIE_STATUS.SETUP_REC</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>STALL</name>
            <description>Source: SIE_STATUS.STALL_REC</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TRANS_COMPLETE</name>
            <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VBUS_DETECT</name>
            <description>Source: SIE_STATUS.VBUS_DETECTED</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>INT_EP_CTRL</name>
        <description>interrupt endpoint control register</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>INT_EP_ACTIVE</name>
            <description>Host: Enable interrupt endpoint 1 -&gt; 15</description>
            <bitOffset>1</bitOffset>
            <bitWidth>15</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MAIN_CTRL</name>
        <description>Main control register</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CONTROLLER_EN</name>
            <description>Enable controller</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HOST_NDEVICE</name>
            <description>Device mode = 0, Host mode = 1</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SIM_TIMING</name>
            <description>Reduced timings for simulation</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>NAK_POLL</name>
        <description>Used by the host controller. Sets the wait time in microseconds before trying again if the device replies with a NAK.</description>
        <addressOffset>0x6C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x100010</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DELAY_FS</name>
            <description>NAK polling interval for a full speed device</description>
            <bitOffset>16</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DELAY_LS</name>
            <description>NAK polling interval for a low speed device</description>
            <bitOffset>0</bitOffset>
            <bitWidth>10</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SIE_CTRL</name>
        <description>SIE control register</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DIRECT_DM</name>
            <description>Direct control of DM</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DIRECT_DP</name>
            <description>Direct control of DP</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DIRECT_EN</name>
            <description>Direct bus drive enable</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_DOUBLE_BUF</name>
            <description>Device: EP0 single buffered = 0, double buffered = 1</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_INT_1BUF</name>
            <description>Device: Set bit in BUFF_STATUS for every buffer completed on EP0</description>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_INT_2BUF</name>
            <description>Device: Set bit in BUFF_STATUS for every 2 buffers completed on EP0</description>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_INT_NAK</name>
            <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK</description>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>EP0_INT_STALL</name>
            <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>KEEP_ALIVE_EN</name>
            <description>Host: Enable keep alive packet (for low speed bus)</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PREAMBLE_EN</name>
            <description>Host: Preable enable for LS device on FS hub</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PULLDOWN_EN</name>
            <description>Host: Enable pull down resistors</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PULLUP_EN</name>
            <description>Device: Enable pull up resistor</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RECEIVE_DATA</name>
            <description>Host: Receive transaction (IN to host)</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RESET_BUS</name>
            <description>Host: Reset bus</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>RESUME</name>
            <description>Device: Remote wakeup. Device can initiate its own resume after suspend.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>RPU_OPT</name>
            <description>Device: Pull-up strength (0=1K2, 1=2k3)</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SEND_DATA</name>
            <description>Host: Send transaction (OUT from host)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SEND_SETUP</name>
            <description>Host: Send Setup packet</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SOF_EN</name>
            <description>Host: Enable SOF generation (for full speed bus)</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SOF_SYNC</name>
            <description>Host: Delay packet(s) until after SOF</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>START_TRANS</name>
            <description>Host: Start transaction</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>STOP_TRANS</name>
            <description>Host: Stop transaction</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
          <field>
            <name>TRANSCEIVER_PD</name>
            <description>Power down bus transceiver</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VBUS_EN</name>
            <description>Host: Enable VBUS</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SIE_STATUS</name>
        <description>SIE status register</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ACK_REC</name>
            <description>ACK received. Raised by both host and device.</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>BIT_STUFF_ERROR</name>
            <description>Bit Stuff Error. Raised by the Serial RX engine.</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>BUS_RESET</name>
            <description>Device: bus reset received</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>CONNECTED</name>
            <description>Device: connected</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>CRC_ERROR</name>
            <description>CRC Error. Raised by the Serial RX engine.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>DATA_SEQ_ERROR</name>
            <description>Data Sequence Error.


 The device can raise a sequence error in the following conditions:


 * A SETUP packet is received followed by a DATA1 packet (data phase should always be DATA0) * An OUT packet is received from the host but doesn&apos;t match the data pid in the buffer control register read from DPSRAM


 The host can raise a data sequence error in the following conditions:


