JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VREG_AND_CHIP_RESET</name>
      <description>control and status for on-chip voltage regulator and chip level reset subsystem</description>
      <groupName>VREG_AND_CHIP_RESET</groupName>
      <baseAddress>0x40064000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>BOD</name>
        <description>brown-out detection control</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x91</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>enable

 0=not enabled, 1=enabled</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>VSEL</name>
            <description>threshold select

 0000 - 0.473V

 0001 - 0.516V

 0010 - 0.559V

 0011 - 0.602V

 0100 - 0.645V

 0101 - 0.688V

 0110 - 0.731V

 0111 - 0.774V

 1000 - 0.817V

 1001 - 0.860V (default)

 1010 - 0.903V

 1011 - 0.946V

 1100 - 0.989V

 1101 - 1.032V

 1110 - 1.075V

 1111 - 1.118V</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CHIP_RESET</name>
        <description>Chip reset control and status</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>HAD_POR</name>
            <description>Last reset was from the power-on reset or brown-out detection blocks</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HAD_PSM_RESTART</name>
            <description>Last reset was from the debug port</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>HAD_RUN</name>
            <description>Last reset was from the RUN pin</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>PSM_RESTART_FLAG</name>
            <description>This is set by psm_restart from the debugger.

 Its purpose is to branch bootcode to a safe mode when the debugger has issued a psm_restart in order to recover from a boot lock-up.

 In the safe mode the debugger can repair the boot code, clear this flag then reboot the processor.</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>VREG</name>
        <description>Voltage regulator control and status</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xB1</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>enable

 0=not enabled, 1=enabled</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>HIZ</name>
            <description>high impedance mode select

 0=not in high impedance mode, 1=in high impedance mode</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ROK</name>
            <description>regulation status

 0=not in regulation, 1=in regulation</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>VSEL</name>
            <description>output voltage select

 0000 to 0101 - 0.80V

 0110 - 0.85V

 0111 - 0.90V

 1000 - 0.95V

 1001 - 1.00V

 1010 - 1.05V

 1011 - 1.10V (default)

 1100 - 1.15V

 1101 - 1.20V

 1110 - 1.25V

 1111 - 1.30V</description>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG</name>
      <groupName>WATCHDOG</groupName>
      <baseAddress>0x40058000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>CTRL</name>
        <description>Watchdog control

 The rst_wdsel register determines which subsystems are reset when the watchdog is triggered.

 The watchdog can be triggered in software.</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x7000000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENABLE</name>
            <description>When not enabled the watchdog timer is paused</description>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PAUSE_DBG0</name>
            <description>Pause the watchdog timer when processor 0 is in debug mode</description>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PAUSE_DBG1</name>
            <description>Pause the watchdog timer when processor 1 is in debug mode</description>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>PAUSE_JTAG</name>
            <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TIME</name>
            <description>Indicates the number of ticks / 2 (see errata RP2040-E1) before a watchdog reset will be triggered</description>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TRIGGER</name>
            <description>Trigger a watchdog reset</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>LOAD</name>
        <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to 0xffffff / 2 ticks before triggering a watchdog reset (see errata RP2040-E1).</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>LOAD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>24</bitWidth>
            <access>write-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>REASON</name>
        <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FORCE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TIMER</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SCRATCH0</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH1</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH2</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH3</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH4</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH5</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH6</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>SCRATCH7</name>
        <description>Scratch register. Information persists through soft reset of the chip.</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>TICK</name>
        <description>Controls the tick generator</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x200</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>COUNT</name>
            <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>CYCLES</name>
            <description>Total number of clk_tick cycles before the next tick.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>9</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ENABLE</name>
            <description>start / stop tick generation</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RUNNING</name>
            <description>Is the tick generator running?</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
