JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>XIP_CTRL</name>
      <description>QSPI flash execute-in-place block</description>
      <groupName>XIP_CTRL</groupName>
      <baseAddress>0x14000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <interrupt>
        <name>XIP_IRQ</name>
        <value>6</value>
      </interrupt>
      <registers>
      <register>
        <name>CTRL</name>
        <description>Cache control</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x3</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>EN</name>
            <description>When 1, enable the cache. When the cache is disabled, all XIP accesses

 will go straight to the flash, without querying the cache. When enabled,

 cacheable XIP accesses will query the cache, and the flash will

 not be accessed if the tag matches and the valid bit is set.


 If the cache is enabled, cache-as-SRAM accesses have no effect on the

 cache data RAM, and will produce a bus error response.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>ERR_BADWRITE</name>
            <description>When 1, writes to any alias other than 0x0 (caching, allocating)

 will produce a bus fault. When 0, these writes are silently ignored.

 In either case, writes to the 0x0 alias will deallocate on tag match,

 as usual.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>POWER_DOWN</name>
            <description>When 1, the cache memories are powered down. They retain state,

 but can not be accessed. This reduces static power dissipation.

 Writing 1 to this bit forces CTRL_EN to 0, i.e. the cache cannot

 be enabled when powered down.

 Cache-as-SRAM accesses will produce a bus error response when

 the cache is powered down.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTR_ACC</name>
        <description>Cache Access counter

 A 32 bit saturating counter that increments upon each XIP access,

 whether the cache is hit or not. This includes noncacheable accesses.

 Write any value to clear.</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </register>
      <register>
        <name>CTR_HIT</name>
        <description>Cache Hit counter

 A 32 bit saturating counter that increments upon each cache hit,

 i.e. when an XIP access is serviced directly from cached data.

 Write any value to clear.</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </register>
      <register>
        <name>FLUSH</name>
        <description>Cache Flush control</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FLUSH</name>
            <description>Write 1 to flush the cache. This clears the tag memory, but

 the data memory retains its contents. (This means cache-as-SRAM

 contents is not affected by flush or reset.)

 Reading will hold the bus (stall the processor) until the flush

 completes. Alternatively STAT can be polled until completion.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>clear</modifiedWriteValues>
          </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <description>Cache Status</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x2</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>FIFO_EMPTY</name>
            <description>When 1, indicates the XIP streaming FIFO is completely empty.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FIFO_FULL</name>
            <description>When 1, indicates the XIP streaming FIFO is completely full.

 The streaming FIFO is 2 entries deep, so the full and empty

 flag allow its level to be ascertained.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FLUSH_READY</name>
            <description>Reads as 0 while a cache flush is in progress, and 1 otherwise.

 The cache is flushed whenever the XIP block is reset, and also

 when requested via the FLUSH register.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STREAM_ADDR</name>
        <description>FIFO stream address</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>STREAM_ADDR</name>
            <description>The address of the next word to be streamed from flash to the streaming FIFO.

 Increments automatically after each flash access.

 Write the initial access address here before starting a streaming read.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>30</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STREAM_CTR</name>
        <description>FIFO stream control</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>STREAM_CTR</name>
            <description>Write a nonzero value to start a streaming read. This will then

 progress in the background, using flash idle cycles to transfer

