JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
 a linear data block from flash to the streaming FIFO.

 Decrements automatically (1 at a time) as the stream

 progresses, and halts on reaching 0.

 Write 0 to halt an in-progress stream, and discard any in-flight

 read, so that a new stream can immediately be started (after

 draining the FIFO and reinitialising STREAM_ADDR)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>22</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STREAM_FIFO</name>
        <description>FIFO stream data

 Streamed data is buffered here, for retrieval by the system DMA.

 This FIFO can also be accessed via the XIP_AUX slave, to avoid exposing

 the DMA to bus stalls caused by other XIP traffic.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-only</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>XIP_SSI</name>
      <description>DW_apb_ssi has the following features:

 * APB interface – Allows for easy integration into a DesignWare Synthesizable Components for AMBA 2 implementation.

 * APB3 and APB4 protocol support.

 * Scalable APB data bus width – Supports APB data bus widths of 8, 16, and 32 bits.

 * Serial-master or serial-slave operation – Enables serial communication with serial-master or serial-slave peripheral devices.

 * Programmable Dual/Quad/Octal SPI support in Master Mode.

 * Dual Data Rate (DDR) and Read Data Strobe (RDS) Support - Enables the DW_apb_ssi master to perform operations with the device in DDR and RDS modes when working in Dual/Quad/Octal mode of operation.

 * Data Mask Support - Enables the DW_apb_ssi to selectively update the bytes in the device. This feature is applicable only in enhanced SPI modes.

 * eXecute-In-Place (XIP) support - Enables the DW_apb_ssi master to behave as a memory mapped I/O and fetches the data from the device based on the APB read request. This feature is applicable only in enhanced SPI modes.

 * DMA Controller Interface – Enables the DW_apb_ssi to interface to a DMA controller over the bus using a handshaking interface for transfer requests.

 * Independent masking of interrupts – Master collision, transmit FIFO overflow, transmit FIFO empty, receive FIFO full, receive FIFO underflow, and receive FIFO overflow interrupts can all be masked independently.

 * Multi-master contention detection – Informs the processor of multiple serial-master accesses on the serial bus.

 * Bypass of meta-stability flip-flops for synchronous clocks – When the APB clock (pclk) and the DW_apb_ssi serial clock (ssi_clk) are synchronous, meta-stable flip-flops are not used when transferring control signals across these clock domains.

 * Programmable delay on the sample time of the received serial data bit (rxd) enables programmable control of routing delays resulting in higher serial data-bit rates.

 * Programmable features:

 - Serial interface operation – Choice of Motorola SPI, Texas Instruments Synchronous Serial Protocol or National Semiconductor Microwire.

 - Clock bit-rate – Dynamic control of the serial bit rate of the data transfer used in only serial-master mode of operation.

 - Data Item size (4 to 32 bits) – Item size of each data transfer under the control of the programmer.

 * Configured features:

 - FIFO depth – 16 words deep. The FIFO width is fixed at 32 bits.

 - 1 slave select output.

 - Hardware slave-select – Dedicated hardware slave-select line.

 - Combined interrupt line - one combined interrupt line from the DW_apb_ssi to the interrupt controller.

 - Interrupt polarity – active high interrupt lines.

 - Serial clock polarity – low serial-clock polarity directly after reset.

 - Serial clock phase – capture on first edge of serial-clock directly after reset.</description>
      <groupName>XIP_SSI</groupName>
      <baseAddress>0x18000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>BAUDR</name>
        <description>Baud rate</description>
        <addressOffset>0x14</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SCKDV</name>
            <description>SSI clock divider</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRLR0</name>
        <description>Control register 0</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>CFS</name>
            <description>Control frame size

 Value of n -&gt; n+1 clocks per frame.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DFS</name>
            <description>Data frame size</description>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>DFS_32</name>
            <description>Data frame size in 32b transfer mode

 Value of n -&gt; n+1 clocks per frame.</description>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>FRF</name>
            <description>Frame format</description>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCPH</name>
            <description>Serial clock phase</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SCPOL</name>
            <description>Serial clock polarity</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SLV_OE</name>
            <description>Slave output enable</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI_FRF</name>
            <description>SPI frame format</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>STD</name>
                <description>Standard 1-bit SPI frame format 1 bit per SCK, full-duplex</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>DUAL</name>
                <description>Dual-SPI frame format two bits per SCK, half-duplex</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>QUAD</name>
                <description>Quad-SPI frame format four bits per SCK, half-duplex</description>
                <value>2</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>SRL</name>
            <description>Shift register loop (test mode)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SSTE</name>
            <description>Slave select toggle enable</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TMOD</name>
            <description>Transfer mode</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>TX_AND_RX</name>
                <description>Both transmit and receive</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>TX_ONLY</name>
                <description>Transmit only (not for FRF == 0, standard SPI mode)</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RX_ONLY</name>
                <description>Receive only (not for FRF == 0, standard SPI mode)</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>EEPROM_READ</name>
                <description>EEPROM read mode (TX then RX RX starts after control data TX&apos;d)</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRLR1</name>
        <description>Master Control register 1</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>NDF</name>
            <description>Number of data frames</description>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DMACR</name>
        <description>DMA control</description>
        <addressOffset>0x4C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RDMAE</name>
            <description>Receive DMA enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TDMAE</name>
            <description>Transmit DMA enable</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DMARDLR</name>
        <description>DMA RX data level</description>
        <addressOffset>0x54</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DMARDL</name>
            <description>Receive data watermark level (DMARDLR+1)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DMATDLR</name>
        <description>DMA TX data level</description>
        <addressOffset>0x50</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DMATDL</name>
            <description>Transmit data watermark level</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>DR0</name>
        <description>Data Register 0 (of 36)</description>
        <addressOffset>0x60</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DR</name>
            <description>First data register of 36</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ICR</name>
        <description>Interrupt clear</description>
        <addressOffset>0x48</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ICR</name>
            <description>Clear-on-read all active interrupts</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IDR</name>
        <description>Identification register</description>
        <addressOffset>0x58</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x51535049</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>IDCODE</name>
            <description>Peripheral dentification code</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>IMR</name>
        <description>Interrupt mask</description>
        <addressOffset>0x2C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MSTIM</name>
            <description>Multi-master contention interrupt mask</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXFIM</name>
            <description>Receive FIFO full interrupt mask</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXOIM</name>
            <description>Receive FIFO overflow interrupt mask</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>RXUIM</name>
            <description>Receive FIFO underflow interrupt mask</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXEIM</name>
            <description>Transmit FIFO empty interrupt mask</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TXOIM</name>
            <description>Transmit FIFO overflow interrupt mask</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>ISR</name>
        <description>Interrupt status</description>
        <addressOffset>0x30</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MSTIS</name>
            <description>Multi-master contention interrupt status</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXFIS</name>
            <description>Receive FIFO full interrupt status</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXOIS</name>
            <description>Receive FIFO overflow interrupt status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXUIS</name>
            <description>Receive FIFO underflow interrupt status</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXEIS</name>
            <description>Transmit FIFO empty interrupt status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXOIS</name>
            <description>Transmit FIFO overflow interrupt status</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MSTICR</name>
        <description>Multi-master interrupt clear</description>
        <addressOffset>0x44</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MSTICR</name>
            <description>Clear-on-read multi-master contention interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>MWCR</name>
        <description>Microwire Control</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MDD</name>
            <description>Microwire control</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MHS</name>
            <description>Microwire handshaking</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>MWMOD</name>
            <description>Microwire transfer mode</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RISR</name>
        <description>Raw interrupt status</description>
        <addressOffset>0x34</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>MSTIR</name>
            <description>Multi-master contention raw interrupt status</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXFIR</name>
            <description>Receive FIFO full raw interrupt status</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXOIR</name>
            <description>Receive FIFO overflow raw interrupt status</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RXUIR</name>
            <description>Receive FIFO underflow raw interrupt status</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXEIR</name>
            <description>Transmit FIFO empty raw interrupt status</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXOIR</name>
            <description>Transmit FIFO overflow raw interrupt status</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RXFLR</name>
        <description>RX FIFO level</description>
        <addressOffset>0x24</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXTFL</name>
            <description>Receive FIFO level</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RXFTLR</name>
        <description>RX FIFO threshold level</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RFT</name>
            <description>Receive FIFO threshold</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RXOICR</name>
        <description>RX FIFO overflow interrupt clear</description>
        <addressOffset>0x3C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXOICR</name>
            <description>Clear-on-read receive FIFO overflow interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
