JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      <register>
        <name>RXUICR</name>
        <description>RX FIFO underflow interrupt clear</description>
        <addressOffset>0x40</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RXUICR</name>
            <description>Clear-on-read receive FIFO underflow interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>RX_SAMPLE_DLY</name>
        <description>RX sample delay</description>
        <addressOffset>0xF0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>RSD</name>
            <description>RXD sample delay (in SCLK cycles)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SER</name>
        <description>Slave enable</description>
        <addressOffset>0x10</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SER</name>
            <description>For each bit:

 0 -&gt; slave not selected

 1 -&gt; slave selected</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SPI_CTRLR0</name>
        <description>SPI control</description>
        <addressOffset>0xF4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x3000000</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ADDR_L</name>
            <description>Address length (0b-60b in 4b increments)</description>
            <bitOffset>2</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INST_DDR_EN</name>
            <description>Instruction DDR transfer enable</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>INST_L</name>
            <description>Instruction length (0/4/8/16b)</description>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>NONE</name>
                <description>No instruction</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>4B</name>
                <description>4-bit instruction</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>8B</name>
                <description>8-bit instruction</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>16B</name>
                <description>16-bit instruction</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>SPI_DDR_EN</name>
            <description>SPI DDR transfer enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>SPI_RXDS_EN</name>
            <description>Read data strobe enable</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>TRANS_TYPE</name>
            <description>Address and instruction transfer format</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>1C1A</name>
                <description>Command and address both in standard SPI frame format</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>1C2A</name>
                <description>Command in standard SPI format, address in format specified by FRF</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>2C2A</name>
                <description>Command and address both in format specified by FRF (e.g. Dual-SPI)</description>
                <value>2</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>WAIT_CYCLES</name>
            <description>Wait cycles between control frame transmit and data reception (in SCLK cycles)</description>
            <bitOffset>11</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>XIP_CMD</name>
            <description>SPI Command to send in XIP mode (INST_L = 8-bit) or to append to Address (INST_L = 0-bit)</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <description>Status register</description>
        <addressOffset>0x28</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BUSY</name>
            <description>SSI busy flag</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>DCOL</name>
            <description>Data collision error</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFF</name>
            <description>Receive FIFO full</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>RFNE</name>
            <description>Receive FIFO not empty</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TFE</name>
            <description>Transmit FIFO empty</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TFNF</name>
            <description>Transmit FIFO not full</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXE</name>
            <description>Transmission error</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSIENR</name>
        <description>SSI Enable</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSI_EN</name>
            <description>SSI enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>SSI_VERSION_ID</name>
        <description>Version ID</description>
        <addressOffset>0x5C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x3430312A</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>SSI_COMP_VERSION</name>
            <description>SNPS component version (format X.YY)</description>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TXD_DRIVE_EDGE</name>
        <description>TX drive edge</description>
        <addressOffset>0xF8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>TDE</name>
            <description>TXD drive edge</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TXFLR</name>
        <description>TX FIFO level</description>
        <addressOffset>0x20</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>TFTFL</name>
            <description>Transmit FIFO level</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TXFTLR</name>
        <description>TX FIFO threshold level</description>
        <addressOffset>0x18</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>TFT</name>
            <description>Transmit FIFO threshold</description>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>TXOICR</name>
        <description>TX FIFO overflow interrupt clear</description>
        <addressOffset>0x38</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>TXOICR</name>
            <description>Clear-on-read transmit FIFO overflow interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
