JustAnother1/pio_inline_assembler/res/Raspberry Pi--RP2040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>XOSC</name>
      <description>Controls the crystal oscillator</description>
      <groupName>XOSC</groupName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
        <protection>n</protection>
      </addressBlock>
      <registers>
      <register>
        <name>COUNT</name>
        <description>A down counter running at the xosc frequency which counts to zero and stops.

 To start the counter write a non-zero value.

 Can be used for short software pauses when setting up time sensitive hardware.</description>
        <addressOffset>0x1C</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>COUNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>CTRL</name>
        <description>Crystal Oscillator Control</description>
        <addressOffset>0x0</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>ENABLE</name>
            <description>On power-up this field is initialised to DISABLE and the chip runs from the ROSC.

 If the chip has subsequently been programmed to run from the XOSC then setting this field to DISABLE may lock-up the chip. If this is a concern then run the clk_ref from the ROSC and enable the clk_sys RESUS feature.

 The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
            <bitOffset>12</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>DISABLE</name>
                <description>None</description>
                <value>3358</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>ENABLE</name>
                <description>None</description>
                <value>4011</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>FREQ_RANGE</name>
            <description>Frequency range. This resets to 0xAA0 and cannot be changed.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>1_15MHZ</name>
                <description>None</description>
                <value>2720</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_1</name>
                <description>None</description>
                <value>2721</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_2</name>
                <description>None</description>
                <value>2722</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_3</name>
                <description>None</description>
                <value>2723</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
        </fields>
      </register>
      <register>
        <name>DORMANT</name>
        <description>Crystal Oscillator pause control

 This is used to save power by pausing the XOSC

 On power-up this field is initialised to WAKE

 An invalid write will also select WAKE

 WARNING: stop the PLLs before selecting dormant mode

 WARNING: setup the irq before selecting dormant mode</description>
        <addressOffset>0x8</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
      </register>
      <register>
        <name>STARTUP</name>
        <description>Controls the startup delay</description>
        <addressOffset>0xC</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0xC4</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>DELAY</name>
            <description>in multiples of 256*xtal_period. The reset value of 0xc4 corresponds to approx 50 000 cycles.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>14</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>X4</name>
            <description>Multiplies the startup_delay by 4. This is of little value to the user given that the delay can be programmed directly.</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
          </field>
        </fields>
      </register>
      <register>
        <name>STATUS</name>
        <description>Crystal Oscillator Status</description>
        <addressOffset>0x4</addressOffset>
        <size>32</size>
        <access>read-write</access>
        <protection>n</protection>
        <resetValue>0x0</resetValue>
        <resetMask>0x0</resetMask>
        <fields>
          <field>
            <name>BADWRITE</name>
            <description>An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE or DORMANT</description>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <modifiedWriteValues>oneToClear</modifiedWriteValues>
          </field>
          <field>
            <name>ENABLED</name>
            <description>Oscillator is enabled but not necessarily running and stable, resets to 0</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>FREQ_RANGE</name>
            <description>The current frequency range setting, always reads 0</description>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>1_15MHZ</name>
                <description>None</description>
                <value>0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_1</name>
                <description>None</description>
                <value>1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_2</name>
                <description>None</description>
                <value>2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>RESERVED_3</name>
                <description>None</description>
                <value>3</value>
              </enumeratedValue>
        </enumeratedValues>
          </field>
          <field>
            <name>STABLE</name>
            <description>Oscillator is running and stable</description>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
        </fields>
      </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
